[
  {
    "document_title": "Словарь - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/slovar",
    "section_title": "Определения словаря",
    "text": "Следующей структурой данных, которую мы рассмотрим, будет словарь (map, dictionary), или так называемый ассоциативный массив, позволяющий хранить пары вида «ключ — значение». Ключ — уникальный идентификатор, а значение может быть любой объектной переменной, включая другие структуры данных. Например, списки или другие словари. Ключи и значения могут выводиться в различном порядке, потому что словари не упорядочены. Аналогично множеству, у словаря существует мультисловарь (multimap), который позволяет хранить несколько элементов с одинаковым ключом. Посмотрите на примеры ниже. Довольно часто словари реализуют с использованием хеш-таблиц. Говоря об асимптотической сложности операций со словарём, будем иметь ввиду реализацию на хеш-таблицах. Основные операции со словарем и их асимптотическая сложность: Добавление нового элемента с уникальным ключом —. Удаление элемента по ключу —. Изменение значения по ключу —. Получение значения по ключу —.",
    "useful_links": []
  },
  {
    "document_title": "Словарь - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/slovar",
    "section_title": "Что дальше",
    "text": "Теперь вы знаете, как устроен словарь, и умеете использовать его для хранения данных, связанных с уникальными ключами, и быстрого поиска по этим ключам. Вы познакомились с операциями вставки, удаления, изменения и извлечения значений. Следующий шаг — дек (двусторонняя очередь). В отличие от обычной очереди, здесь можно добавлять и удалять элементы как с начала, так и с конца. Вы увидите, как дек сочетает свойства очереди и стека и где именно такая гибкость оказывается особенно полезной. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Словарь хранит пары «ключ — значение» и обеспечивает быстрый доступ по ключу. Большинство операций (добавление, удаление, поиск) выполняются за константное время при реализации через хеш-таблицу. Словари часто используют для подсчёта, группировки и хранения вложенных структур. Мультимапы позволяют хранить несколько значений для одного ключа.",
    "useful_links": [
      {
        "text": "задачам",
        "url": "https://new.contest.yandex.ru/contest/80786"
      },
      {
        "text": "гайд",
        "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"
      },
      {
        "text": "сообщество Хендбука",
        "url": "https://t.me/handbook_algorithms"
      }
    ]
  }
]