{"document_title": "Вычисление НОК и НОД - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/vychislenie-nok-i-nod", "section_title": "Ключевые вопросы параграфа", "text": "Как работает алгоритм Евклида и чем он лучше наивных подходов? Как связаны НОД и НОК, и как их вычислить быстро даже для больших чисел? Почему важно контролировать сложность алгоритма даже в задачах с простой формулировкой?", "useful_links": []}
{"document_title": "Вычисление НОК и НОД - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/vychislenie-nok-i-nod", "section_title": "Наибольший общий делитель", "text": "Наибольший общий делительдвух положительных целых чисели— это самое большое целое число, на которое можно поделитьибез остатка. Двадцать три века назад греческий математик Евклид впервые описал, как найти самый большой общий делитель.Однако нам до сих пор неизвестно имя математика, разработавшего этот алгоритм за век до Евклида. Спустя много веков алгоритм Евклида ещё раз обнаружили индийские и китайские астрономы. Теперь эффективный алгоритм, вычисляющий наибольший общий делитель, — важный ингредиент для современных криптографических алгоритмов. Ваша задача — использовать алгоритм Евклида для вычисления. Формат ввода: Целые числаи(разделённые пробелом). Формат вывода:. Ограничения:. Примеры Числа 18 и 35 не обладают общими нетривиальными делителями. ,. Простой, но ужасно медленный способ вычислить наибольший общий делитель: Скопировать код1GCD(a, b):2ford отmin(a,b) вниз до1:3ifa % d ==0andb % d ==0:// d делит a и d делит b4returnd Рисунок к задаче даёт нам простую, но чрезвычайно важную подсказку: если и, иможно разделить на, значит иможно разделить на. Оказывается, что верно и обратное. Докажите, чтопри. Это наблюдение позволяет нам вычислить наибольший общий делитель,отнимая меньшее число от большего снова и снова.В конце концов одно из чисел дойдет до нуля. В таком случае мы просто возвращаем другое число (если, то). Скопировать код1GCD(a, b):2whilea >0andb >0:3ifa >= b:4a = a−b5else:6b = b−a7returnmax(a,b) Насколько этот алгоритм быстрый? Этот алгоритм всё ещё слишком медленный. Например, приион продолжает отниматьот— более миллиона раз (в то время как изначальный алгоритм находит наибольший общий делитель приимоментально), так как ему нужно только пройти через. Но не беспокойтесь. Сейчас мы сделаем наш алгоритм эффективнее. Правильно! Мы получим 6 — остатокпри делении на 7. Сказанное выше приводит нас к алгоритму Евклида. Скопировать код1GCD(a, b):2whilea >0andb >0:3ifa >= b:4a = a % b5else:6b = b % a7returnmax(a,b) Это быстрый алгоритм: при любых, он вычисляет их наибольший общий делитель мгновенно. Для значенийв этом диапазоне количество итераций циклаwhileне превышает сотни. Обоснование этого утверждения можно построить на факте, что после каждой итерации одно из чисел становится как минимум в два раза меньше. Следовательно, после максимумитераций или, илидойдёт до нуля. Так как,. В качестве последнего комментария мы подметим, что такой же алгоритм можно использовать рекурсивно, занимая всего три строки кода. Скопировать код1GCD(a, b):2ifa =0orb =0:3returnmax(a,b)4returnGCD(b,a mod b)", "useful_links": []}
{"document_title": "Вычисление НОК и НОД - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/vychislenie-nok-i-nod", "section_title": "Наименьшее общее кратное", "text": "Наименьшее общее кратноедля двух положительных целых чисели— это самое маленькое целое число, которое можно разделить и на, и на. Рисунок выше демонстрируетдля каждой пары чисел,и, а также наименьшее общее кратное для всех трёх. Рисунок ниже показывает наибольший общий делитель для этих же чисел. Формат ввода: Целые числаи(разделённые пробелом). Формат вывода: Ограничения:. Примеры — Среди всех положительных целых чисел, которые можно разделить и на 6, и на 8 (например, 48, 480 и 24), 24 — наименьшее число.— Совет: для деления целых чисел вPython3используйте//(вместо/) Для обоснования соотношениярассмотрим разложениеина простые множители. Если простоевходит в разложениев степении в разложение— в степени, тоделится на, адолжно делиться на. Для завершения обоснования формулы стоит использовать соотношение.", "useful_links": []}
{"document_title": "Вычисление НОК и НОД - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/vychislenie-nok-i-nod", "section_title": "Что дальше", "text": "Теперь вы знаете, как эффективно вычислять наибольший общий делитель при помощи алгоритма Евклида — и почему он работает в разы быстрее наивных подходов. Вы также научились находить наименьшее общее кратное и увидели, как связаны эти два понятия. Всё это — основа для задач, в которых важно понимать делимость и оптимально работать с числами. Далее — короткое заключение, в котором мы подведём итоги главы и соберём всё, чему вы научились в задачах на Фибоначчи, НОД и НОК. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Алгоритм Евклида позволяет быстро находить наибольший общий делитель и работает значительно эффективнее наивных решений. НОК удобно вычислять через НОД, используя формулу LCM(a,b)= a⋅b​ / GCD(a,b).", "useful_links": [{"text": "задачам", "url": "https://new.contest.yandex.ru/contest/80764"}, {"text": "гайд", "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"}, {"text": "сообщество Хендбука", "url": "https://t.me/handbook_algorithms"}]}
