[
  {
    "document_title": "Рекурсивные алгоритмы - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/rekursivnye-algoritmy",
    "section_title": "Ключевые вопросы параграфа",
    "text": "В чём сила и в чём слабость рекурсии по сравнению с итеративным подходом? Как разложение задачи на подзадачи помогает описывать решения? Что показывает пример «Ханойских башен» о возможностях и ограничениях рекурсивных алгоритмов?",
    "useful_links": []
  },
  {
    "document_title": "Рекурсивные алгоритмы - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/rekursivnye-algoritmy",
    "section_title": "Что такое рекурсия",
    "text": "Рекурсия — одно из самых распространенных алгоритмических понятий. Если говорить просто, то рекурсивным алгоритм становится, если вызывает сам себя. Головоломка «Ханойские башни» состоит из трёх стержней, пронумеруем их слева направо: 1, 2 и 3. Также в головоломке используется стопка дисков с отверстием посередине. Радиус дисков уменьшается снизу вверх. Изначально диски расположены на левом стержне (стержень 1), самый большой диск находится внизу. Диски в игре перемещаются по одному со стержня на стержень. Диск можно надеть на стержень, только если он пустой или верхний диск на нём большего размера, чем перемещаемый. Цель головоломки — перенести все диски со стержня 1 на стержень 3. Попробуйте нашу интерактивную версию «Ханойских башен» и узнайте, как переместить все диски с одного стержня на другой. Вывод списка действий, необходимых для решения головоломки «Ханойские башни». Входные данные: Целое число. Выходные данные: Последовательность ходов для решения головоломки «Ханойские башни» издисков. Решить головоломку с одним диском легко — просто переместите его на правый стержень. Головоломка на два диска ненамного сложнее. Сначала нужно переместить маленький диск на стержень посередине, а большой — на стержень справа. Затем переместить маленький диск на большой на правом стержне. Версия на три диска чуть сложнее, но и ее можно решить с помощью следующих семи шагов: Переместить диск со стержня 1 на стержень 3 Переместить диск со стержня 1 на стержень 2 Переместить диск со стержня 3 на стержень 2 Переместить диск со стержня 1 на стержень 3 Переместить диск со стержня 2 на стержень 1 Переместить диск со стержня 2 на стержень 3 Переместить диск со стержня 1 на стержень 3 Теперь давайте посчитаем, сколько шагов потребуется для решения версии на четыре диска. Нам нужно обязательно переместить самый большой диск, но для этого придётся сперва поместить все остальные диски на пустой стержень. Если у нас не три диска, а четыре, то нужно переложить три верхних диска на пустой стержень (7 действий), а затем переместить самый большой диск (1 действие). Теперь нужно снова переместить три диска с «временного» стержня на самый большой диск (еще 7 действий). Весь процесс будет состоять издействий. Чтобы переместитьдисков с левого стержня на правый, сначала необходимо переместитьдисков на стержень посередине. Затем, когда диск под номером, самый большой, оказывается на правом стержне, нужно переместить на него оставшиеся диски со стержня посередине. Чтобы переместитьдисков со стержня посередине направо, нужно сначала переместитьдисков на стержень слева, затем переместить-й диск вправо, потом переместитьдисков с левого стержня на правый и так далее. На первый взгляд задача «Ханойские башни» может показаться сложной. Тем не менее данный рекурсивный алгоритм находит нужные перемещения дисков всего за 8 строк! Скопировать код1HanoiTowers(n,fromPeg,toPeg)2ifn =1:3output “Move disk from peg fromPeg to peg toPeg”4return5unusedPeg =6- fromPeg - toPeg6HanoiTowers(n−1,fromPeg,unusedPeg)7output “Move disk from peg fromPeg to peg toPeg”8HanoiTowers(n−1,unusedPeg,toPeg) Переменныеиуказывают на три разных стержня. Таким образом,HanoiTowers(n, 1, 3)перемещает диски (шт.) с первого стержня на третий. Переменнаяуказывает, какой из трёх стержней можно использовать для временного хранения первых () дисков. Обратите внимание, чтовсегда равняется. Таким образом, значение переменнойможно определить как. Представленная таблица показывает результатыдля всех возможных переменныхи. Определивкак, операторы выполняют более простую задачу: они сначала перемещаютдисков на временный стержень, затем перекладывают большой диск, а потом складывают на него оставшиесядисков. Скопировать код1HanoiTowers(n−1,fromPeg,unusedPeg)2output “Move disk from peg fromPeg to peg toPeg”3HanoiTowers(n−1,unusedPeg,toPeg) Обратите внимание, что нет необходимости указывать, какой диск игрок должен переложить сна: перемещается всегда тот диск, что является верхним на. Хотя решение Ханойских башен можно уложить в 9 строк псевдокода, его выполнение займет на удивление много времени. Решение головоломки на пять дисков состоит из 31 действия. А в решении башни из сотни дисков количество действий будет исчисляться “страшными” нонилионами. Такое резкое увеличение числа действий дляHanoiTowersнеудивительно. Заметим, что каждый раз, когда вызываетсяHanoiTowers(n, 1, 3), алгоритм дважды вызывает сам себя для перемещениядисков, что запускает четыре вызова для перемещениядисков и так далее. Это можно проиллюстрировать с помощью рекурсивного дерева, изображенного нарис.. ВызовHanoiTowers(4, 1, 3)приводит к вызовамHanoiTowers(3, 1, 2)иHanoiTowers(3, 2, 3); каждый из них вызываетHanoiTowers(2, 1, 3),HanoiTowers(2, 3, 2)иHanoiTowers(2, 2, 1),HanoiTowers(2, 1, 3)и так далее. Каждый вызов подпрограммыHanoiTowersзанимает определенное время. Мы хотим узнать, сколько времени уйдёт на такой алгоритм. Чтобы вычислить время выполненияHanoiTowersразмера, мы введём в рассмотрение функцию— количество перемещений дисков, которые выполняетHanoiTowers(n). Получается следующее уравнение: Начиная с, это рекуррентное соотношение задаёт последовательность: и так далее. Мы можем вычислить, прибавив 1 с обеих сторон и обнаружив, что Если мы введём новое обозначение,, то. Таким образом, нужно решить следующее рекуррентное соотношение: Начиная с, получаем последовательность То есть,и. Следовательно,HanoiTowers(n)— экспоненциальный алгоритм.",
    "useful_links": [
      {
        "text": "рис.",
        "url": "#Placeholder-1-15"
      }
    ]
  },
  {
    "document_title": "Рекурсивные алгоритмы - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/rekursivnye-algoritmy",
    "section_title": "Что дальше",
    "text": "Теперь вы знаете, как работает рекурсия и почему она может быть мощным инструментом для построения алгоритма. Вы научились разбивать задачу на шаги, каждый из которых решается тем же способом, что и вся задача целиком. Далее — алгоритмы «Разделяй и властвуй». Мы разберём, как делить задачу на независимые части, решать каждую по отдельности и собирать общее решение. Вы увидите, как этот подход ложится в основу быстрой сортировки и других эффективных алгоритмов. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Рекурсия — это подход, при котором функция вызывает саму себя для решения подзадачи. Чтобы рекурсивное решение работало, важно определить базовый случай и убедиться, что каждый шаг приближает нас к нему. Задача «Ханойские башни» — классический пример, в котором рекурсивная стратегия описывает процесс из десятков или сотен шагов с минимальным кодом. Количество операций в рекурсивных алгоритмах может расти экспоненциально — это важно учитывать при выборе метода решения задачи.",
    "useful_links": [
      {
        "text": "задачам",
        "url": "https://new.contest.yandex.ru/contest/79930"
      },
      {
        "text": "гайд",
        "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"
      },
      {
        "text": "сообщество Хендбука",
        "url": "https://t.me/handbook_algorithms"
      }
    ]
  }
]