{"document_title": "Алгоритмы «Разделяй и властвуй» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/razdelyaj-i-vlastvuj", "section_title": "Ключевые вопросы параграфа", "text": "В чём суть подхода «Разделяй и властвуй» и как он помогает ускорить решение задач? Как работает MergeSort и чем он отличается от наивных алгоритмов сортировки? Почему объединение результатов подзадач — не менее важный шаг, чем их решение?", "useful_links": []}
{"document_title": "Алгоритмы «Разделяй и властвуй» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/razdelyaj-i-vlastvuj", "section_title": "Алгоритм «Разделяй и властвуй»", "text": "Одна большая задача может казаться трудной. Но если разделить её на две задачи в два раза меньше, она станет намного проще. Для таких случаев хорошо подходят алгоритмы «разделяй и властвуй». Они так и работают: разделяют задачу на более мелкие подзадачи, независимо находят решения для них и соединяют результаты в решение изначальной задачи. Конечно, реальные ситуации бывают более сложными, чем мы описали. После разделения одной задачи на подзадачи, алгоритм обычно делит их на ещё более мелкие под-подзадачи и так далее. Он продолжает это делать, пока не дойдёт до точки, где в рекурсии уже нет необходимости. В качестве примера алгоритма «разделяй и властвуй» приведём задачу сортировки: Сортировка: Отсортируйте набор целых чисел. Входные данные: Список изразных чисел. Выходные данные: Отсортированный список целых чисел. Измененный порядокцелых чисел от, где. SelectionSort— это простой итерационный метод решения задачи по сортировке. Сначала он находит самый маленький элемент в, а затем меняет его местами с первым элементом (то есть с). Затем он находит второй самый маленький элемент ви переставляет его на второе место, меняя элемент местами с. Повторяя это действие в-й раз,SelectionSortнаходит-й самый маленький элемент ви переставляет его на-е место. Если,SelectionSort(a)будет состоять из следующих семи шагов: Время выполненияSelectionSortквадратично, то есть: используетсяитераций, для каждого из которых требуется время, чтобы просканировать не болееэлементов и найти самый большой из них для суффикса. Тем не менее общее время выполнения растёт как:", "useful_links": []}
{"document_title": "Алгоритмы «Разделяй и властвуй» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/razdelyaj-i-vlastvuj", "section_title": "АлгоритмMergeSort", "text": "MergeSort— классический пример алгоритма «разделяй и властвуй» для сортировки. Он намного быстрее, чемSelectionSort. Начнём с задачи слияния, в которой нам нужно будет объединить два отсортированных списка —и— в один отсортированный список. АлгоритмMergeобъединяет два отсортированных списка в один за время. Для этого алгоритм повторно выбирает самый маленький элемент из оставшихся вии перемещает его в растущий отсортированный список. Скопировать код1Merge(List_1,List_2):2SortedList = ...// empty list3whileboth List_1andList_2 are non-empty:4ifthe smallest element in List_1 is smaller than the smallest element in List_2:5move the smallest element from List_1 to the end of SortedList6else:7move the smallest element from List_2 to the end of SortedList8move any remaining elements from either List_1orList_2 to the end of SortedList9returnSortedList Merge— полезный инструмент для сортировки произвольного списка, если мы знаем, как разделить неотсортированный список на две отсортированные половины. Вам может показаться, что мы вернулись к тому, с чего начали, только теперь нам нужно отсортировать два меньших списка вместо одного большого. Но сортировка двух мелких списков — более предпочтительная алгоритмическая задача. Чтобы понять, почему это так, мы рассмотрим алгоритмMergeSort. Он разделяет неотсортированный список на две части и использует рекурсию для выполнения мелких задач перед тем, как объединить отсортированные списки. Скопировать код1MergeSort(List):2ifList consists of a single element:3returnList4FirstHalf = first half of List5SecondHalf = second half of List6SortedFirstHalf =MergeSort(FirstHalf)7SortedSecondHalf =MergeSort(SecondHalf)8SortedList =Merge(SortedFirstHalf,SortedSecondHalf)9returnSortedList Нарис.изображено рекурсивное деревоMergeSort, состоящее изуровней, где— размер изначального неотсортированного списка. На нижнем уровне нам нужно объединить два отсортированных списка размером примерно вэлементов, что займётвремени. На следующем самом высоком уровне нам нужно объединить четыре списка изэлементов, что потребуетвремени. Такой шаблон можно описать следующим образом:-й уровень состоит изсписков, каждый из которых включает в себя приблизительноэлементов и занимаетвремени для объединения. Так как в рекурсивном деревеуровней, выполнениеMergeSortпотребует в общемвремени, что даёт нам большое ускорение по сравнению с более наивнымалгоритмом сортировки.", "useful_links": [{"text": "рис.", "url": "#Placeholder-1-18"}]}
{"document_title": "Алгоритмы «Разделяй и властвуй» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/razdelyaj-i-vlastvuj", "section_title": "Что дальше", "text": "Теперь вы знаете, как работает подход «Разделяй и властвуй» и как с его помощью ускорить решение задач. Вы научились использовать рекурсию, объединять подзадачи и применять это к сортировке. Далее — рандомизированные алгоритмы. Вы увидите, как случайность может стать преимуществом в вычислениях, и узнаете, почему некоторые вероятностные алгоритмы работают быстрее, чем детерминированные. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Подход «Разделяй и властвуй» помогает решать задачи, разбивая их на части и объединяя решения. Алгоритм MergeSort сортирует список за O(n log n) благодаря рекурсивному делению и слиянию. Такие алгоритмы часто быстрее наивных и хорошо масштабируются.", "useful_links": [{"text": "задачам", "url": "https://new.contest.yandex.ru/contest/79935"}, {"text": "гайд", "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"}, {"text": "сообщество Хендбука", "url": "https://t.me/handbook_algorithms"}]}
