{"document_title": "Задача «Рекламная кампания» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-reklamnaya-kampaniya", "section_title": "Ключевые вопросы параграфа", "text": "Как работает жадный алгоритм в задаче выбора по критерию «прибыль за ресурс»? Почему важно доказывать корректность жадного подхода, а не полагаться только на интуицию? Как оформить решение, чтобы оно было корректным, понятным и быстрым?", "useful_links": []}
{"document_title": "Задача «Рекламная кампания» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-reklamnaya-kampaniya", "section_title": "Дробный выбор", "text": "Представим, что вы владелец популярной страницы в интернете, на которой естьрекламных мест. Вы хотите продать их рекламодателям, которые рассчитывают на,икликов в день и при этом готовы платить,иза клик. Как подобрать пары рекламных мест и рекламодателей так, чтобы получить максимальную прибыль? Например, доход от отмеченных голубым цветом пар, приведённых выше, составитдолларов; от отмеченных чёрным —. Входные данные: В первой строке приведено целое число, во второй — последовательность целых чисел, в третьей — последовательность целых чисел. Выходные данные: Максимальное значение, где— это перестановка. Ограничения:;для всех. . . Суть решения заключается в том, чтобы отдать самое популярное рекламное место самому дорогому объявлению. Вас вряд ли удивит, что жадный подход даст максимальную прибыль. Предположим, чтои— самые большие элементы:идля всех. Мы утверждаем, что существует оптимальное решение, объединяющеес. Чтобы доказать это, возьмём оптимальное решение и предположим, что в нём объединеныидляиидля. Покажем, что замена парина парыитолько повысит прибыль. Давайте оценим, как такая замена повлияет на общую прибыль. До замены рассматриваемые элементы давали следующую прибыль: После замены: Таким образом, замена увеличивает общую прибыль на Это приводит нас к алгоритму, который объединяет рекламное объявление с максимальным количеством кликов за максимальную цену, исключает их из вариантов на рассмотрение и повторяет то же самое. Скопировать код1Revenue(Click,Price):2revenue =03whileclicks isnotempty:4p = index with largest Click[p]5q = index with largest Price[q]6revenue = revenue+Clicks[p]⋅Price[q]7remove p-th element of Click8remove q-th element of Price9returnrevenue Время выполнения. Время выполнения этого алгоритма —. В каждой изитераций мы проводим линейное сканирование и находим два самых больших элемента. Также можно отсортировать эти два списка заранее, чтобы не искать самый большой элемент с нуля при каждой итерации. Это приводит нас к решению с временем выполнения.", "useful_links": []}
{"document_title": "Задача «Рекламная кампания» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-reklamnaya-kampaniya", "section_title": "Что дальше", "text": "Теперь вы знаете, как работать с задачами, где допускается дробный выбор, и почему жадный отбор по плотности гарантирует оптимальное решение. Вы также увидели, что при работе с вещественными числами важно следить за точностью вычислений и оформлением кода. Далее — задача с другим типом постановки: нужно покрыть набор отрезков минимальным числом точек. Такой приём встречается, например, в планировании размещения рекламных щитов вдоль трассы или выборе минимального числа дат для встреч, чтобы все участники могли присутствовать. Это ещё один пример, где жадный алгоритм работает эффективно, — если правильно обосновать его корректность. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. В задачах с «дробным» выбором можно брать часть объекта, чтобы максимизировать результат — это принципиально отличается от дискретных задач. Жадная стратегия по убыванию плотности гарантирует оптимальное решение именно в дробном случае, но не всегда работает для целочисленных вариантов. Доказательство оптимальности помогает понять границы применения жадных алгоритмов и увидеть, где они перестают работать. Работа с вещественными числами требует особой аккуратности, чтобы избежать ошибок округления и потери точности.", "useful_links": [{"text": "задачам", "url": "https://new.contest.yandex.ru/contest/80767"}, {"text": "гайд", "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"}, {"text": "сообщество Хендбука", "url": "https://t.me/handbook_algorithms"}]}
