{"document_title": "Принципы построения алгоритмов - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/principy-postroeniya-algoritmov", "section_title": "Ключевые вопросы параграфа", "text": "В чём суть динамического программирования и как оно отличается от других стратегий? Как выделить подзадачи и сформулировать рекуррентное соотношение? Как реализовать и оптимизировать алгоритм, чтобы он работал быстро и экономно?", "useful_links": []}
{"document_title": "Принципы построения алгоритмов - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/principy-postroeniya-algoritmov", "section_title": "Алгоритмы динамического программирования", "text": "Динамическое программирование на практике применяется в большом числе случаев. Оно подходит и для поиска похожих страниц в интернете, и для предсказывания генов в последовательностях ДНК.", "useful_links": []}
{"document_title": "Принципы построения алгоритмов - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/principy-postroeniya-algoritmov", "section_title": "Основная идея", "text": "Для понимания идеи, которая используется в подходе динамического программирования, предлагаем вам попробовать решить следующую головоломку. Интерактивная головоломка «Количество путей». В нижеприведённой сети есть множество путей ведущих отк, — например:и. Каково общее количество путей? Так как мы начинаем с, существует уникальный способ добраться до. Давайте запишем: Дляитакже существует просто один путь. Так как существует только один путь ки только один к, количество путей ксоставляет(и). Аналогичным образом для достижениянеобходимо прийти либо к, либо к. Существует только один путь дои два пути до. Так количество путей, которые ведут к, составляет(,и). Количество путей, заканчивающихся на, равно, так как кможно прийти только от. Доесть два пути, до— три пути, до— один. Выходит, что путей досуществует. Рассмотрим наше решение головоломки «Количество путей» и изложим основные идеи динамического программирования. Для узла—будет количеством путей от стартового узлак узлу. Несомненно,. Это называется базовый случай. Соответствующее значение для всех других узлов можно найти с помощью рекуррентного соотношения: где предшественник— это узел, связанный ребром с. Многие алгоритмы динамического программирования используют одну схему: — Вместо того, чтобы решать изначальную задачу, алгоритм решает несколько подзадач такого же типа.— Алгоритм вычисляет решение для каждой подзадачи с помощью рекуррентного соотношения, в которое входят решения более мелких подзадач.— Алгоритм сохраняет решения подзадач и таким образом избегает перевычисления. Теперь рассмотрим взвешенный граф, в котором у каждого ребраобозначена длина. Длина пути в таком графе определяется суммой длины рёбер. Например, длина путисоставляет. Какова минимальная длина пути отдо? Так как каждый путь отдопроходит через,илиперед тем, как прийти к, где— минимальная длина пути отдо. Расстояния до,иможно найти с помощью похожих рекуррентных соотношений: Приведём рекуррентные соотношения дляи: Наконец, базовый случай — это. С его помощью можно найти расстояние до всех узлов сети, включая наш узел. Для этого нужно использовать вышеприведённые рекуррентные соотношения, которые можно записать в компактной форме: Для модельной ситуации удобно записывать результаты по мере того, как мы выполняем вычисления, прямо на изображении. Мы получаем следующие результаты. В алгоритме динамического программирования для этого выполняется бэктрекинг («поиск с возвратом») решений, которые привели к оптимальному результату. В особенности отметим один из трёх выборов, который приводит нас к значению. Исходя из этого, мы можем заключить, что последнее ребро оптимального пути — это. Аналогично, так мы приходим отк. Таким образом, путь отдодлинойсоставляет У вышеприведённой сети есть удобное свойство. Оно заключается в том, что мы можем определять порядок её узлов, что обеспечивает следующее: каждый узел идет после всех предшествующих — то есть узлы, которые указывают на текущий узел (например,,ипредшествуют). Сети с таким свойством называются ориентированные ациклические графы. Мы увидим, что многие алгоритмы динамического программирования используют ориентированные ациклические графы — явно или неявно.", "useful_links": []}
{"document_title": "Принципы построения алгоритмов - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/principy-postroeniya-algoritmov", "section_title": "Проектирование алгоритмов динамического программирования", "text": "Теперь, когда вы познакомились с несколькими алгоритмами динамического программирования, подведём итог и повторим основные шаги для проектирования таких алгоритмов. Определить подпроблемы.Первый и самый важный шаг — это идентифицировать подпроблемы и записать рекуррентное соотношение (с базовым случаем). Как правило, это делается через анализ структуры оптимального решения или через оптимизацию решения, использующего исчерпывающий поиск. Спроектировать рекурсивный алгоритм.Сделать из рекуррентного соотношения рекурсивный алгоритм:сохранить решение каждой подзадачи в таблице;перед решением подзадачи проверить, нет ли уже в таблице её решения (мемоизация). сохранить решение каждой подзадачи в таблице; перед решением подзадачи проверить, нет ли уже в таблице её решения (мемоизация). Спроектировать итерационный алгоритм.Сделать из рекурсивного алгоритма итерационный алгоритм:инициализировать таблицу;продвигаться от мелких подзадач к большим. инициализировать таблицу; продвигаться от мелких подзадач к большим. Оценить время выполнения.Доказать верхнее ограничение времени выполнения. Обычно произведение количества подпроблем и времени, необходимого для решения подзадачи, предоставляет верхнее ограничение времени выполнения. Обнаружить решение.Обнаружить оптимальное решение, используя бэктрекинг рекуррентного соотношения. Экономить место.Использовать обычную структуру таблицы, чтобы проверить, можно ли сэкономить место по сравнению с более прямым решением.", "useful_links": []}
{"document_title": "Принципы построения алгоритмов - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/principy-postroeniya-algoritmov", "section_title": "Что дальше", "text": "Теперь вы знаете, как работает динамическое программирование, — от базовых случаев и рекурсии до оптимизированных решений с таблицами и перебором подзадач. Вы познакомились с идеей сохранения промежуточных результатов, научились вычислять количество путей в графе и находить кратчайшие маршруты. Этот подход ляжет в основу всех задач этой главы. Далее — задача «Размен-2». Вы увидите, как динамическое программирование позволяет находить минимальное количество монет, даже когда жадный алгоритм не справляется. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться.", "useful_links": [{"text": "сообщество Хендбука", "url": "https://t.me/handbook_algorithms"}]}
