[
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Ключевые вопросы параграфа",
    "text": "Что такое редакционное расстояние и как оно используется на практике? Как устроена рекурсивная формулировка задачи и почему мемоизация помогает? Как динамически находить расстояние между всеми префиксами двух строк? Как оптимизировать решение по памяти и находить выравнивание?",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Варианты применения задачи",
    "text": "Есть множество вариантов, как применить задачу «Расстояние редактирования». Она подойдёт для обработки текстов на естественном языке, проверки правописания и других направлений. К примеру, биологи зачастую вычисляют редакционное расстояние, когда ищут мутации, вызывающие болезни. Редакционное расстояние между двумя строками определяется как минимальное число односимвольных вставок, удалений и замен, необходимых для преобразования одной строки в другую. Входные данные:Две строки, состоящие из строчных букв латинского алфавита. Выходные данные:Редакционное расстояние между строками. Ограничения:Длина обеих строк не меньшеи не больше. Вторую строку можно получить из первой, удалив s, заменив h на p и вставив s. Это можно компактно продемонстрировать следующим выравниванием. Удалить e, вставить s после i, заменить i на a, заменить g на c, вставить e в конце. Совет: будьте осторожны с рекурсией. Рассмотрим решение задачи. Выравнивание двух строк в двухрядной матрице осуществляется таким образом, чтобы первый (второй) ряд содержал упорядоченные символы первой (второй) строки, которые перемежаются пробелами («»).В колонке не может быть два пробела одновременно в обеих строках.",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Упражнение",
    "text": "Вычислите количество разных пар выравненных строк длинойи. Мы классифицируем колонки выравнивания следующим образом (первый символ из верхней строки, второй — из нижней): — колонка с символом и пробелом — это удаление; — колонка с пробелом и символом — вставка; — колонка с двумя одинаковыми символами — совпадение; — колонка с двумя разными символами — это несоответствие. Мы ищем выравнивание, при котором минимизируется общее количество несоответствий, удалений и вставок. Выравнивание считается оптимальным по сравнению со всеми другими возможными вариантами, если оно содержит минимум несоответствий, удалений и вставок.Стоит обратить внимание, что может быть несколько различных оптимальных выравниваний.",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Упражнение",
    "text": "Докажите, что задача на редакционное расстояние может быть сведена к поиску оптимального выравнивания двух строк. В примере выше последняя колонка — это вставка. Отбросив эту колонку, мы получаем оптимальное выравнивание первой строки и префикса второй. Рассмотрим идею рассчитать редакционное расстояние между каждой парой префиксов двух строк. Это более общая постановка задачи, но важно отметить, что, решив её, мы найдём ответ и на интересующий нас вопрос. Имея строкии, мы рассмотрим их префиксыидлинойии обозначим их редакционное расстояние. Так как последняя колонка оптимального выравниванияи— это или вставка, или удаление, или несоответствие, или совпадение, имеем, Базовый случай для этого рекуррентного соотношения —и: Это можно выразить более кратко: еслиили, тогда Псевдокод ниже делает из этого рекуррентного соотношения рекурсивный алгоритм и использует мемоизацию для избежания перевычислений. Скопировать код1table = associative array23EditDistance(A,B,i,j):4iftable[i,j] isnotyet computed:5ifi=0orj=0:6table[i,j] =max(i,j)7else:8insertion =EditDistance(A,B,i,j−1)+19deletion =EditDistance(A,B,i−1,j)+110match =EditDistance(A,B,i−1,j−1)11mismatch =EditDistance(A,B,i−1,j−1)+112ifA[i]=B[j]:13table[i,j] =min(insertion,deletion,match)14else:15table[i,j] =min(insertion,deletion,mismatch)16returntable[i,j] Время выполнения этого алгоритма составляет, так как выполняется не большерекурсивных вызовов, которые добавляют значения вtable.",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Рекурсивный алгоритм",
    "text": "Рекурсивный алгоритм вычисляетдля всехи. Из рекурсивного алгоритма можно сделать итерационный, который будет сохранять решения всех подзадач в двумерной таблице. Таблица заполняется по рядам проходами. Это гарантирует, что когда мы вычислим значение клетки, значения клеток,ибудут уже готовы. Скопировать код1EditDistance(A[1…n],B[1…m]):2table =2d array ofsize(n+1) * (m+1)3table[0][j] = jforall i,j4fori from1to n:5forj from1to m:6insertion = table[i][j−1]+17deletion = table[i−1][j]+18match = table[i−1][j−1]9mismatch = table[i−1][j−1]+110ifA[i]=B[j]:11table[i][j] =min(insertion,deletion,match)12else:13table[i][j] =min(insertion,deletion,mismatch)14returntable[n][m] Итоговая таблица для нашего примера изображена на рисунке ниже. Значение каждой клетки вычисляется, исходя из значений соседних клеток сверху, слева и слева-сверху. У каждой клетки входящие стрелки указывают на один или несколько случаев (вставка, удаление, несоответствие, или совпадение), которые приводят к значению этой клетки. Таблица соответствует ориентированному ациклическому графу, в котором все рёбра, за исключением синих, имеют длину. А синие ребра соответствуют совпадающим символам и имеют длину. Алгоритм находит на графе самый короткий путь от узла слева сверху до узла справа снизу. Время выполнения алгоритма составляет. Ему требуетсяячеек памяти для хранения двумерного массиваtable. Расход места может быть снижен до(и даже до), если мы обратим внимание на то, что при заполнении текущего ряда таблицы нам нужны только клетки из текущего и предыдущего. Таким образом, вместо хранения всей таблицы достаточно сохранить текущий и предыдущие ряды. Отметим, что любой путь отдона рисунке образовывает оптимальное выравнивание строки. Путь, изображённый на рисунке ниже, соответствует оптимальному выравниванию editing и distance. Сколько в этом выравнивании вставок, удалений, совпадений и несоответствий? Постройте оптимальное выравнивание, соответствующее этому пути. Оптимальное выравнивание можно обнаружить с помощью перехода по стрелкам в обратную сторону от нижнего правого угла вдоль любого пути, приводящего к верхнему левому углу.",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расстояние редактирования» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstoyanie-redaktirovaniya",
    "section_title": "Что дальше",
    "text": "Теперь вы умеете вычислять редакционное расстояние — минимальное число правок, необходимых для преобразования одной строки в другую. Вы поняли, как формулируется задача рекурсивно, как работает динамическое программирование с таблицей и даже как найти оптимальное выравнивание. Далее — задача на поиск наибольшей общей подпоследовательности (LCS). Вы увидите, как похожие идеи помогают решать другую важную задачу сравнения строк, и научитесь отличать LCS от редакционного расстояния. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Редакционное расстояние — это минимальное число вставок, удалений и замен для превращения одной строки в другую. Его можно вычислить с помощью динамического программирования, заполняя таблицу расстояний между префиксами. Переходы в таблице соответствуют операциям редактирования и дают кратчайший путь в сетке выравнивания. Можно восстановить оптимальное выравнивание, двигаясь по таблице в обратную сторону. Решение можно оптимизировать по памяти, если хранить только два ряда таблицы одновременно.",
    "useful_links": [
      {
        "text": "задачам",
        "url": "https://new.contest.yandex.ru/contest/80779"
      },
      {
        "text": "гайд",
        "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"
      },
      {
        "text": "сообщество Хендбука",
        "url": "https://t.me/handbook_algorithms"
      }
    ]
  }
]