{"document_title": "Задача «Сувениры» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-suveniry", "section_title": "Ключевые вопросы параграфа", "text": "Почему результат арифметического выражения зависит от порядка скобок? Как использовать динамическое программирование для перебора всех вариантов группировки? Как устроены таблицы для хранения минимальных и максимальных значений подвыражений?", "useful_links": []}
{"document_title": "Задача «Сувениры» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-suveniry", "section_title": "Условие задачи", "text": "Три пирата делят свою добычу, в которую входятпредметов разной ценности. Получится у вас помочь разделить добычу поровну? Входные данные:Первая строка содержит целое число. Вторая строка содержит целые числа, разделённые пробелами. Выходные данные:Вывести 1, еслиможно разделить на три поднабора с одинаковыми суммами; в противном случае — вывести 0. Ограничения:,для всех. Пример 1 Пример 2 Пример 3 . Рассмотрим решение задачи. Обозначимкак. Разделить набор изпредметов на три части возможно, только если их общая ценность делится на три. То есть, где— это целое число. Так, нам необходимо разделитьчисел на три части, где сумма чисел в каждой части равна. Одна из этих частей содержит-й трофей (с ценностью). Если мы его уберём, то получим разделение первыхтрофеев на три части таким образом, что ценность двух из них будет равна, а сумма оставшейся части —. Вместо разделения всехпредметов, попробуем решить более мелкую задачу, состоящую в делении первыхпредметов на части с ценностью,и. Если такое разделение возможно, мы присваиваем(в противном случае —) и отмечаем, что пираты могут разделить добычу честно, только если. Предположим, что. Тогда первыечисел можно разделить на три части таким образом, чтобы сумма чисел в первой части составляла, а сумма чисел во второй части —. -й предмет принадлежит первой части. Тогда. Убрав его из первой части, мы разделим первыечисел на три части так, что сумма первых двух частей составити, то есть. -й предмет принадлежит второй части. Как и в предыдущем случае,и. -й предмет принадлежит третьей части. Тогда. Так, значениеможно вычислить, посмотрев на Базовый случай для этого рекуррентного соотношения:и, если. Скопировать код1Split(v[1],…,v[n]):2ifv[1] + … + v[n] не делится целочисленно на3:3returnfalse4V = (v[1] + … + v[n]) /35split = ...// массив размера (n+1) × (V+1) × (V+1)6// заполнить массив split значениями false7split[0][0][0] =true8fori from1to n:9fors1 from0to V:10fors2 from0to V:11split[i][s1][s2] = split[i−1][s1][s2]12ifs1 >= v[i]:13split[i][s1][s2] = split[i][s1][s2] OR split[i -1][s1 - v[i]][s2]14ifs2 >= v[i]:15split[i][s1][s2] = split[i][s1][s2] OR split[i -1][s1][s2 - v[i]]16returnsplit[n][V][V] Время выполнения составляет.", "useful_links": []}
{"document_title": "Задача «Сувениры» - Основы алгоритмов", "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-suveniry", "section_title": "Что дальше", "text": "Теперь вы умеете вычислять максимальное значение арифметического выражения, расставляя скобки в нужном порядке. Вы научились использовать динамическое программирование с запоминанием минимальных и максимальных значений и применять аккуратные рекурсивные формулы. Далее — финальный параграф главы. В нём мы кратко обобщим ключевые идеи, которые вы встретили, и покажем, как они складываются в систему. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Порядок выполнения операций влияет на результат арифметического выражения — важно правильно расставить скобки. Можно эффективно найти максимальное значение, если сохранять минимумы и максимумы всех подвыражений в таблицах. Динамическое программирование позволяет избежать повторных вычислений и уменьшает время работы с экспоненциального до кубического. Даже при небольшом числе операций количество возможных расстановок скобок велико — поэтому важно автоматизировать перебор.", "useful_links": [{"text": "задачам", "url": "https://new.contest.yandex.ru/contest/80782"}, {"text": "гайд", "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"}, {"text": "сообщество Хендбука", "url": "https://t.me/handbook_algorithms"}]}
