[
  {
    "document_title": "Задача «Расставить скобки» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstavit-skobki",
    "section_title": "Ключевые вопросы параграфа",
    "text": "Почему результат арифметического выражения зависит от порядка скобок? Как использовать динамическое программирование для перебора всех вариантов группировки? Как устроены таблицы для хранения минимальных и максимальных значений подвыражений?",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расставить скобки» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstavit-skobki",
    "section_title": "Упражнение",
    "text": "Для выражениясуществуют два способа расставить скобки:и. Для максимального значения нужно поставить в скобки выражение. Входные данные: Ввод содержит только строкудлинойдля некогос символами. Каждый символ на чётной позиции— это цифра (то есть целое число от 0 до 9), а на нечетной позиции — одна из трёх операций из. Выходные данные: Максимальное значение данного арифметического выражения из всех возможных порядков арифметических операций. Ограничения:— таким образом, строка содержит максимумсимволов. Пример 1 Рассмотрим решение задачи. Каждая из пяти операций в выражении может быть последней — внешней. Рассмотрим случай, в котором последняя операция — «», то есть умножение. В этой ситуации нам необходимо поместить дваподвыраженияв скобки таким образом, чтобы произведение значений было максимальным. Чтобы это выяснить, мы находим минимальные и максимальные значения данных двух подвыражений: На основании этих значений мы заключаем, что общее значение произведения составляет. Предположим, что вводный набор данных имеет форму где каждая— это цифра, а каждая— базовая арифметическая операция. Сказанное выше предполагает, что мы вычисляем минимальное и максимальное значение каждого подвыражения в форме где. Пустьи— минимальное и максимальное значениесоответственно. Тогда Базовый случай — это: Эти два рекуррентных соотношения позволяют нам вычислить оптимальные значения, изучив все возможные варианты разделенияна два подвыраженияи. Тогда наше рекуррентное соотношение говорит о том, что дерево состоит из корня и двух поддеревьев. Для нахождения оптимальной формы дерева мы анализируем все возможные корни (за это отвечает параметр), а затем составляем дерево из двух оптимальных поддеревьев.",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расставить скобки» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstavit-skobki",
    "section_title": "Как сделать из рекуррентного соотношения рекурсивный алгоритм",
    "text": "Как обычно, сделать из рекуррентного соотношения рекурсивный алгоритм довольно просто. Рекурсивная процедура берёт индексыив качестве параметров и использует их для вычисления минимального и максимального значения подвыражения. Перед тем, как начать вычисления, проверяется, не сохранены ли уже эти значения в, где— это ассоциативный массив, хранящий уже вычисленные результаты. Если записьотсутствует, рекурсивная процедура вычисляет два значения, используя рекуррентное соотношение, сохраняет их в таблицу и выдаёт их. Конечный ответ соответствуети. Время выполнения составляет: естьвозможных пар, для каждой из которых рекурсивная процедура проверяет возможные значения для. Для переведения рекурсивного алгоритма в итерационный используются двумерные таблицыи, в которых хранятся минимальные и максимальные значения всех подвыражений. Заполняя данные таблицы, нам нужно убедиться, что к окончанию вычислений оптимальных значений дляоптимальные значенияидля всехуже вычислены. Один из способов сделать это — перечислить все парыв порядке возрастания значения. Чтобы это сделать, в псевдокоде ниже используется параметр. Скопировать код1MaxValue(d[0],op[0],d[1],op[1],…d[n]):2mins, maxs =2d-arrays ofsize(n+1)×(n+1)3fill mins with +infinity, fill maxs with -infinity4fori from0to n:5mins[i][i]=d[i], maxs[i][i]←d[i]​6fors from1to n:7forl from1to n-s:8r = l+s9form from l to r-1:10a = mins[l][m] op[m] mins[m+1][r]11b = mins[l][m] op[m] maxs[m+1][r]12c = maxs[l][m] op[m] mins[m+1][r]13d = maxs[l][m] op[m] maxs[m+1][r]14mins[l][r] =min(mins[l][r],a,b,c,d)15maxs[l][r] =max(maxs[l][r],a,b,c,d)16returnmaxs[0][n]",
    "useful_links": []
  },
  {
    "document_title": "Задача «Расставить скобки» - Основы алгоритмов",
    "url": "https://education.yandex.ru/handbook/algorithms/article/zadacha-rasstavit-skobki",
    "section_title": "Что дальше",
    "text": "Теперь вы умеете вычислять максимальное значение арифметического выражения, расставляя скобки в нужном порядке. Вы научились использовать динамическое программирование с запоминанием минимальных и максимальных значений и применять аккуратные рекурсивные формулы. Далее — финальный параграф главы. В нём мы кратко обобщим ключевые идеи, которые вы встретили, и покажем, как они складываются в систему. А пока вы не ушли дальше — закрепите материал на практике: Отметьте, что урок прочитан, при помощи кнопки ниже. Пройдите мини-квиз, чтобы проверить, насколько хорошо вы усвоили тему. Перейдите кзадачамэтого параграфа и потренируйтесь. Перед этим — загляните в короткийгайдо том, как работает система проверки. Хотите обсудить, задать вопрос или не понимаете, почему код не работает? Мы всё предусмотрели — вступайте всообщество Хендбука! Там студенты помогают друг другу разобраться. Порядок выполнения операций влияет на результат арифметического выражения — важно правильно расставить скобки. Можно эффективно найти максимальное значение, если сохранять минимумы и максимумы всех подвыражений в таблицах. Динамическое программирование позволяет избежать повторных вычислений и уменьшает время работы с экспоненциального до кубического. Даже при небольшом числе операций количество возможных расстановок скобок велико — поэтому важно автоматизировать перебор.",
    "useful_links": [
      {
        "text": "задачам",
        "url": "https://new.contest.yandex.ru/contest/80783"
      },
      {
        "text": "гайд",
        "url": "https://education.yandex.ru/handbook/algorithms/article/algo-kak-rabotat-s-sistemoi-proverki-zadanii"
      },
      {
        "text": "сообщество Хендбука",
        "url": "https://t.me/handbook_algorithms"
      }
    ]
  }
]