{"document_title": "Введение в генеративное моделирование", "url": "https://education.yandex.ru/handbook/ml/article/vvedenie-v-generativnoe-modelirovanie", "section_title": "Интерполяции в латентном пространстве", "text": "Большинство моделей генеративного моделирования позволяют семплировать новые объекты. Как правило, в результате обучения генеративной модели мы получаем генератор — функцию, которая на выходе выдаёт объект. В таких моделях, как генеративные состязательные нейронные сети, диффузионные модели, вариационные автокодировщики, генератор на вход принимает вектор случайных значений из простого вероятностного распределения (например, нормального или равномерного). Получается, что, где— объект,— функция генератора, а— вектор случайных значений. Пространство, в котором располагается, называется латентным. Обычно распределениезадаётся ещё до обучения модели и не меняется в процессе. Поскольку мы знаем распределение, мы можем семплировать из него сколько угодно разных. Рассмотрим два вектораииз латентного пространства и два соответствующих им сгенерированных объекта. Так каки— это две точки в латентном пространстве, между ними можно провести линию. Точки, лежащие на этой линии, будут так же принадлежать этому пространству. Если двигаться по этой линии и использовать точки с неё в качестве входа для генератора, то можно получить плавно изменяющийся сгенерированный объект. В примере выше мы рассмотрели движение вдоль линии, однако на практике интерполяция может быть по более сложной траектории. Манипуляции с латентным пространством позволяют не только создавать плавные переходы между объектами, но так же редактировать объекты. Обычно в таких случаях требуется найти направления в латентном пространстве, которое отвечает за нужное свойство сгенерированных объектов. Например, направление, отвечающее за цвет волос или улыбку человека. Подробнее такие методы мы рассмотрим в параграфах про конкретные модели.", "useful_links": []}
{"document_title": "Введение в генеративное моделирование", "url": "https://education.yandex.ru/handbook/ml/article/vvedenie-v-generativnoe-modelirovanie", "section_title": "Применения генеративных моделей", "text": "Зачем может понадобиться генерировать новые данные или восстанавливать их плотность? Самый простой пример – это аугментация набора данных, которая мешает переобучению и улучшает обобщаемость модели. Простые аугментации данных (случайные сдвиги, повороты, масштабирование, изменения цвета и контраста) активно используются почти во всех методах машинного обучения. Генеративные же модели представляют собой более сложный вид аугментации данных, который способен существенно расширить датасет, или обогатить его совершенно новыми элементами. Например, генеративную модель, которая переносит стиль одного изображения на другое (style transfer), можно использовать для обучения более робастных моделей классификации. ВстатьеSandfort et al. используют аугментацию генеративными нейросетями, чтобы улучшить качество сегментации компьютерной томографии. Помимо этого, у генеративных моделей есть ряд других применений для редактирования изображений. Их используют, чтобы повысить разрешение картинок (задача super-resolution). На изображении ниже оригинальную картинку (original) сначала сжали в четыре раза, а потом попробовали восстановить до исходных размеров разными методами. Видно, что метод SRGAN, метод на основе генеративных состязательных нейронных сетях работает гораздо лучше бикубической интерполяции (bicubic), которая обычно применяется по умолчанию и смазывает картинку. С помощью генеративных моделей можно закрашивать пропущенные куски изображений. Это полезно, когда мы хотим удалить с фото других людей, и нам нужно закрасить участки, образовавшиеся после их удаления. Эта функция представлена в некоторых современных смартфонах. В последние несколько лет хорошо стали работать модели, которые генерируют изображения на основе их текстового описания. Среди таких моделей: Stable Diffusion (Демо). Модель с открытымисходным кодом DALLE 2. Доступ по платному API Midjourney. Доступ через Discord Imagen Появились даже специальные базы изображений, сгенерированных нейронными сетями:Lexica,Openart. Доступность таких моделей приводит к появлению множества приложений: Иллюстрации для книг Создание логотипов Создание дизайнов помещений Генерация тату Кроме этого, некоторые модели позволяют совместить несколько задач и делать закрашивание изображения на основе текстового описания. Например, удалять какую-то область и говорить модели, что там должно быть нарисовано. На основе этой технологии появились редакторы изображений с генеративными моделями внутри:Neural love,Photoroom,ZMO. Современные генеративные модели достигли очень хорошего качества и уже стали использоваться в реальных задачах, о которых мы вам рассказали. В следующих параграфах этой главы мы рассмотрим основные методы генеративного обучения более детально.", "useful_links": [{"text": "статье", "url": "https://www.nature.com/articles/s41598-019-52737-x"}, {"text": "Демо", "url": "https://huggingface.co/spaces/stabilityai/stable-diffusion"}, {"text": "исходным кодом", "url": "https://github.com/CompVis/stable-diffusion"}, {"text": "DALLE 2", "url": "https://openai.com/dall-e-2/"}, {"text": "Midjourney", "url": "https://www.midjourney.com/"}, {"text": "Imagen", "url": "https://imagen.research.google/"}, {"text": "Lexica", "url": "https://lexica.art/"}, {"text": "Openart", "url": "https://openart.ai/"}, {"text": "Иллюстрации для книг", "url": "https://www.reddit.com/r/midjourney/comments/x4kk0r/i_created_a_graphic_novel_using_mj_and_now_its_on/"}, {"text": "Создание логотипов", "url": "https://jacobmartins.com/posts/how-i-used-dalle2-to-generate-the-logo-for-octosql/"}, {"text": "Создание дизайнов помещений", "url": "https://interiorai.com/"}, {"text": "Генерация тату", "url": "https://www.tattoosai.com/"}, {"text": "Neural love", "url": "https://neural.love/"}, {"text": "Photoroom", "url": "https://www.photoroom.com/"}, {"text": "ZMO", "url": "https://www.zmo.ai/"}]}
