[
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Основные обозначения",
    "text": "Вспомним определение производной для функции. Функциядифференцируема в точке, если где—дифференциалфункции: линейное отображение из мира-ов в мир значений. Грубо говоря, он превращает «малое приращение» в «малое приращение» («малые» в том смысле, что на о-малое можно плюнуть): Отметим, что дифференциал зависит от точки, в которой он берётся:. Подподразумевается норма вектора, например корень из суммы квадратов координат (обычная евклидова длина). Давайте рассмотрим несколько примеров и заодно разберёмся, какой вид может принимать выражениев зависимости от формы. Начнём со случаев, когда— скалярная функция. В примерах выше нам дважды пришлось столкнуться с давним знакомцем из матанализа:градиентомскалярной функции (у нескалярных функций градиента не бывает). Напомним, что градиентфункции в точкесостоит из частных производных этой функции по всем координатам аргумента. При этом его обычно упаковывают в ту же форму, что и сам аргумент: если— вектор-строка, то и градиент записывается вектор-строкой, а если— матрица, то и градиент тоже будет матрицей того же размера. Это важно, потому что для осуществления градиентного спуска мы должны уметь прибавлять градиент к точке, в которой он посчитан. Как мы уже имели возможность убедиться, для градиента скалярной функциивыполнено равенство где скалярное произведение — это сумма попарных произведений соответствующих координат (да-да, самое обыкновенное). Посмотрим теперь, как выглядит дифференцирование для функций, которые на выходе выдают не скаляр, а что-то более сложное.",
    "useful_links": []
  },
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Простые примеры и свойства матричного дифференцирования",
    "text": "Производная константы.Пусть. Тогдато есть— это нулевое отображение. А если— скалярная функция, то и Производная линейного отображения.Пусть— линейное отображение. ТогдаПоскольку справа линейное отображение, то по определению оно и является дифференциалом. Мы уже видели примеры таких ситуаций выше, когда рассматривали отображения умножения на матрицу слева или справа. Если— (скалярная) линейная функция, то она представляется в видедля некоторого вектора— он и будет градиентом. Линейность производной.Пусть, где— скаляры, а— некоторые отображения, тогда Производная произведения.Пусть, где— некоторые отображения, тогда Это же правило сработает и для скалярного произведения: В этом нетрудно убедиться, повторив доказательство или заметив, что в доказательстве мы пользовались лишь дистрибутивностью (= билинейностью) умножения. Производная сложной функции.Пусть. ТогдаЗдесь— дифференциалв точке, а— это применение отображенияк тому, что в скобках. Итого получаем: Важный частный случай:дифференцирование перестановочно с линейным отображением. Пусть, где— линейное отображение. Тогдасовпадает с самими формула упрощается:",
    "useful_links": []
  },
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Простые примеры вычисления производной",
    "text": "Вычислим дифференциал и градиент функции, где— вектор-столбец,— постоянный вектор. Вычислим производную и градиент, где— вектор-столбец,— постоянная матрица. Вычислим производную обратной матрицы:, где— квадратная матрица. Вычислим градиент определителя:, где— квадратная матрица. Вычислим градиент функции. С этой функцией мы ещё встретимся, когда будем обсуждать задачу линейной регрессии.",
    "useful_links": []
  },
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Примеры вычисления производных сложных функций",
    "text": "Вычислим градиент функции. Вычислим градиент функции. Вычислим градиент функции.",
    "useful_links": []
  },
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Вторая производная",
    "text": "Рассмотрим теперь не первые два, а первые три члена ряда Тейлора: где— второй дифференциал, квадратичная форма, в которую мы объединили все члены второй степени. Вопрос на подумать.Докажите, что второй дифференциал является дифференциалом первого, то есть Зависит ли выражение справа от порядкаи? Этот факт позволяет вычислять второй дифференциал не с помощью приращений, а повторным дифференцированием производной. Вторая производная может оказаться полезной при реализации методов второго порядка или же для проверки того, является ли критическая точка (то есть точка, в которой градиент обращается в ноль) точкой минимума или точкой максимума. Напомним, что квадратичная форманазывается положительно определённой (соответственно, отрицательно определённой), если(соответственно,) для всех, причёмтолько при. Теорема.Пусть функцияимеет непрерывные частные производные второго порядкав окрестности точки, причём. Тогда точкаявляется точкой минимума функции, если квадратичная формаположительно определена, и точкой максимума, если она отрицательно определена. Если мы смогли записать матрицу квадратичной формы второго дифференциала, то мы можем проверить её на положительную или отрицательную определённость с помощьюкритерия Сильвестра.",
    "useful_links": [
      {
        "text": "критерия Сильвестра",
        "url": "https://ru.wikipedia.org/wiki/%D0%9A%D1%80%D0%B8%D1%82%D0%B5%D1%80%D0%B8%D0%B9_%D0%A1%D0%B8%D0%BB%D1%8C%D0%B2%D0%B5%D1%81%D1%82%D1%80%D0%B0"
      }
    ]
  },
  {
    "document_title": "Матричное дифференцирование",
    "url": "https://education.yandex.ru/handbook/ml/article/matrichnoe-differencirovanie",
    "section_title": "Примеры вычисления и использования второй производной",
    "text": "Рассмотрим задачу минимизациипо переменной, где— матрица с линейно независимыми столбцами. Выше мы уже нашли градиент этой функции; он был равен. Мы можем заподозрить, что минимум достигается в точке, где градиент обращается в ноль:. Отметим, что обратная матрица существует, так как, а столбцыпо условию линейно независимы и, следовательно,равен размеру этой матрицы. Но действительно ли эта точка является точкой минимума? Давайте оставим в стороне другие соображения (например, геометрические, о которых мы упомянем в параграфе пролинейные модели) и проверим аналитически. Для этого мы должны вычислить второй дифференциал функции. Мы нашли квадратичную форму второго дифференциала; она, оказывается, не зависит от точки (впрочем, логично: исходная функция была второй степени по, так что вторая производная должна быть константой). Чтобы показать, чтодействительно является точкой минимума, достаточно проверить, что эта квадратичная форма положительно определена. Докажем, что функцияявляется выпуклой вверх на множестве симметричных, положительно определённых матриц. Для этого мы должны проверить, что в любой точке квадратичная форма её дифференциала отрицательно определена. Для начала вычислим эту квадратичную форму. Чтобы доказать требуемое в условии, мы должны проверить следующее: что для любой симметричной матрицыи для любого симметричного (чтобы не выйти из пространства симметричных матриц) приращенияимеем Покажем это явно.Так как— симметричная, положительно определённая матрица, у неё есть симметричный и положительно определённый квадратный корень:Тогда что, конечно, меньше нуля для любой ненулевой.",
    "useful_links": [
      {
        "text": "линейные модели",
        "url": "https://education.yandex.ru/handbook/ml/article/linear-models"
      }
    ]
  }
]