{"document_title": "Вероятностные распределения", "url": "https://education.yandex.ru/handbook/ml/article/veroyatnostnye-raspredeleniya", "section_title": "Вероятностное пространство", "text": "В учебниках вероятность традиционно поставляется в комплекте свероятностным пространством. Не увлекаясь чрезмерным формализмом, можно сказать, что для задания вероятностного пространства нужны: непустое множество, называемое пространствомэлементарных событий(исходов); алгебрамножеств— набор подмножеств, замкнутый относительно дополнений, объединений и пересечений; каждый элементназываетсясобытием; вероятностная мера, приписывающая каждому событиюнекоторуювероятность. К вероятностному пространствупредъявляются следующие требования: (невозможноесобытие),(достоверноесобытие); ; , еслии(аддитивность). Упражнение. Докажите, чтои, если. Аддитивность вероятности легко обобщается по индукции до свойстваконечной аддитивности: если событияпопарно несовместны, то Множествочасто называютносителем; говорят также, что вероятностная мера (масса)сосредоточена, илираспределена, на носителе. В зависимости от типа носителяраспределения делятся на два типа:дискретныеинепрерывные.", "useful_links": [{"text": "вероятностным пространством", "url": "https://ru.wikipedia.org/wiki/%D0%92%D0%B5%D1%80%D0%BE%D1%8F%D1%82%D0%BD%D0%BE%D1%81%D1%82%D0%BD%D0%BE%D0%B5_%D0%BF%D1%80%D0%BE%D1%81%D1%82%D1%80%D0%B0%D0%BD%D1%81%D1%82%D0%B2%D0%BE"}, {"text": "алгебра", "url": "https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B3%D0%B5%D0%B1%D1%80%D0%B0_%D0%BC%D0%BD%D0%BE%D0%B6%D0%B5%D1%81%D1%82%D0%B2"}]}
{"document_title": "Вероятностные распределения", "url": "https://education.yandex.ru/handbook/ml/article/veroyatnostnye-raspredeleniya", "section_title": "Дискретные распределения", "text": "Вероятность на не более чем счётном пространстве элементарных событийзадаётся просто приписыванием неотрицательного числакаждому элементарному исходус условием. Для произвольного событияполагают. Набор чиселназывают такжераспределением вероятностейна множестве. В англоязычной литературе распространён терминprobability mass function(сокращённоpmf). Зачастую в результате эксперимента нас интересуют не вероятности событий сами по себе, а значения некоторой связанной с нимислучайной величины, принимающей числовые значения. Например: сумма очков, выпавших при броске двух кубиков; число метеоритов диаметром более одного метра, падающих на Землю в течение года; ежедневный доход от показа рекламных объявлений в интернете. На каждом элементарном исходеслучайная величинапринимает некоторое числовое значение. Иными словами, случайная величина — это функция, принимающая значениес вероятностью; еёматематическое ожидание(среднее) идисперсия(среднеквадратичное отклонение) вычисляются по формулам соответственно. Корень из дисперсииназваютстандартным отклонениемслучайной величины. Стандартное отклонение и дисперсия показывают, насколько далеко значения случайной величины могут отклоняться от среднего значения. Стандартное отклонение хорошо тем, что, в отличие от дисперсии, измеряется в тех же единицах, что и сама случайная величина. Так называется распределение вероятностней на множестве, у которого,. Тогда, и мы получили формулу из классического подхода к вероятности, при котором вероятность события равна отношению числа благоприятных исходов к общему их количеству. Равномерным распределением моделируются различные игровые ситуации: подбрасывание симметричной монеты (,); подбрасывание кубика (,); вращение рулетки в казино (для европейской,для американской). Упражнение.У европейской рулетки почёрных и красных секторов и один сектор «зеро». Игрок ставит €10 на чёрное. В случае успеха казино выплачивает ему ещё €10, в противном случае забирает ставку. Чему равно математическое ожидание, дисперсия и стандартное отклонение выигрыша? Вопрос на подумать. Бывают ли равномерные распределения в пространствах со счётным носителем? Равномерные распределения преимущественно встречаются в разного сорта играх. В более жизненных ситациях случайность обычно распределена отнюдь не равномерно. Так называется очень простое распределение всего лишь с двумя исходами: Бернуллиевскаяслучайная величина— это просто индикаторная функция успешного события:, если случился «успех»,, если нас постигла «неудача». Несложные вычисления показывают, что Если, то снова получается равномерное распределение с двумя исходами. Прибернуллиевская случайная величина моделирует подбрасывание несимметричной монеты. В машинном обучении часто встречается задача бинарной классификации, и разбиение на классы обычно кодируется с помощью, например: диагностика болезни (болен —, здоров —); оценка кредитоспособности клиента (одобрить кредит —, отказать); предсказание поведения пользователя (кликнет на рекламу —, пропустит —). В этих примерах вероятности классов явно не равны, поэтому несимметричное распределение Бернулли — типичная ситуация в реальных задачах. Биномиальное распределениеимеет сумма независимых бернуллиевских случайных величин:, если. Другими словами, случайная величинаравна количеству успехов внезависимых испытаниях Бернулли с вероятностью успеха. Случайная величинапринимает значения отдо, и Отметим, что согласнобиному Ньютона поэтому числадействительно представляют собой распределение вероятностей, называемое такжебиномиальным. Если, то Пример. Каждый день рекламу компании А поисковой выдаче Яндекса видят ровночеловек. Вчераиз них кликнули на рекламу. Для прогнозирования объемов продаж компании А хочется знать, с какой вероятностью не менее 50 людей кликнут на ее рекламу сегодня. Если моделировать наличие или отсутствие клика бернуллиевской случайной величиной, то общее количество кликов за день моделируется случайной величинойс параметрамии. Тогда с помощью вычислительной техники получаем, что Отметим, что параметрв предыдущем примере нам, строго говоря, не был известен, и вместо него мы использовали частотную оценку. Это распределение имеет счётный носитель. Случайная величинаимеетпуассоновское распределениес параметром,, если Известное разложение экспоненты в ряд Тейлорапозволяет заключить, что вероятности распределения Пуассона действительно суммируются в единицу. Этот же ряд позволяет вычислить, что Пуассоновская случайная величина моделирует число редких событий, происходящих в течение фиксированного промежутка времени: если события наступают со средней скоростью, то Иногда приходится рассматривать биномиальное распределениес большим числом попытоки вероятностью успехас условием. Оказывается, что вне зависимости оттакое распределение быстро стабилизируется, сходясь к пуассоновскому распределению с параметром. Точнее говоря, справедлива следующая теорема. Теорема (Пуассон). Пустьи. Тогда Пример. Известно, что на поисковой выдаче яндекса на рекламу компании А кликает в среднем примерно 50 пользоваталей в день. Количество показов достаточно большое и может меняться изо дня в день. Требуется оценить вероятность того, что сегодня будет совершено не менее 50 кликов по рекламным объявлениям. Распределение количества кликов снова будем моделировать биномиальным распределением. На этот раз числонам неизвестно, но сказано, что оно велико и(вспомним, что, если). Поэтому можно воспользоваться теоремой Пуассона и заменить биномиальное распределение пуассоновским с параметром. Тогда искомая вероятность равна что практически совпадает ответом, полученным с помощью биномиального распределения при. Пусть монетка с вероятностью «успеха»подбрасывается до тех пор, пока впервые не случится «успех». Случайная величина, равная общему количеству попыток на этом пути, имеетгеометрическоераспределение, т.е. По формуле геометрической прогрессии находим, что поэтому с нормировкой тут всё в порядке. Чем меньше, тем больше геометрическое распределение похоже на равномерное, что подтверждают и формулы для среднего и дисперсии: Пример. По оценкам за предыдущие дни пользователь нажимает на рекламу с вероятностью. Сегодня компания B планирует показать очень важное рекламное объявление и требует от Яндекса, чтобы с вероятностью не менеена него кликнули хотя бы раз. Скольким различным людям следует показать это объявление? Здесь мы имеем дело с геометрическим распределением с вероятностью «успеха» (клика): именно так распределена случайная величина, равная количеству показов объявления до первого клика по нему. Следовательно, Эта вероятность должна быть не меньше, т. е.. Отсюда находим, что. Таким образом, рекламу надо показать как минимумраз. Пример. Известно, что партия издеталей содержитбракованных. Какова вероятность того, что среди выбранных наугаддеталей окажется ровнобракованных? Всего естьспособов выборадеталей из партии. Число вариантов выбратьдеталей избракованных ииздеталей без дефектов равно. По классическому определению вероятности получаем, что искомая вероятность равна Такое распределение называетсягипергеометрическим. Равенство следует изтождества Вандермонда. Если случайная величинаимеет гипергеометрическое распределение с параметрами,,, то Гипергеометрическое распределение является аналогом биномиального, при котором моделируется выбор без возвращения с вероятностью успеха.", "useful_links": [{"text": "биному Ньютона", "url": "https://ru.wikipedia.org/wiki/%D0%91%D0%B8%D0%BD%D0%BE%D0%BC_%D0%9D%D1%8C%D1%8E%D1%82%D0%BE%D0%BD%D0%B0"}, {"text": "тождества Вандермонда", "url": "https://ru.wikipedia.org/wiki/%D0%A2%D0%BE%D0%B6%D0%B4%D0%B5%D1%81%D1%82%D0%B2%D0%BE_%D0%92%D0%B0%D0%BD%D0%B4%D0%B5%D1%80%D0%BC%D0%BE%D0%BD%D0%B4%D0%B0"}]}
{"document_title": "Вероятностные распределения", "url": "https://education.yandex.ru/handbook/ml/article/veroyatnostnye-raspredeleniya", "section_title": "Непрерывные распределения", "text": "Вероятностная модель с конечным или счётным носителем не подходит в тех случаях, когда результатом эксперимента удобно считать произвольное действительное число, например, распределение людей по росту или по весу. Для этого требуется пересмотреть подход к построению пространства элементарных событий: ведь множество действительных чиселконтинуально, и поэтому вероятность события не получится определить как сумму вероятностей всех составляющих исходов, коих тоже может оказаться континуум. Приходится искать другие способы задания вероятности. Наиболее часто встречающийся на практике класс непрерывных распределений на числовой прямой задаётся с помощью неотрицательной интегрируемой функцииплотности(probability density function,pdf)со свойством Вероятность событияопределяется как при условии, что этот интеграл имеет смысл. В частности, Замечание. Связь между вероятностью и плотностью распределения весьма напоминает связь между массой и физической плотностью. Когда плотность объекта всюду одинакова, то масса равна плотности, умноженной на объём. Если же объект неоднороден, то плотность становится функцией, сопоставляющей каждой точке некое число (что-то вроде предела отношения массы малого шарика вокруг этой точки к объёму шарика). Тогда масса любого куска объекта может быть вычислена, как интеграл функции плотности по объёму этого куска. С плотностью вероятностиавтоматически связана случайная величина, для которой. Функцияназывается плотностью случайной величины, и обозначается также как. Иногда используется запись. Среднее и дисперсия случайной величинывычисляются по формулам Равномерноераспределение на отрезке, которое часто обозначают, имеет постоянную плотность на этом отрезке: Если, то Вопрос на подумать. Можно ли задать равномерное распределения на неограниченном промежутке, например, наили на? Аналогичным образом вводится равномерное распределение в многомерном пространстве: если множествоимеет объём, то плотность равномерно распределённой наслучайной величинызадаётся как. Если, то и мы получили формулугеометрической вероятности. Случайная величинаимеетнормальное(гауссовское) распределение, если её плотность равна Параметры нормального распределенияпредставляют собой его среднее и дисперсию: Параметротвечает за выраженность «колокола» плотности нормального распределения: при«колокол» приобретает очертания резко выраженного пика, то есть практически вся вероятностная масса сосретдоточена в малой окрестности точки; при«колокол», наоборот, размывается, и распределение становится больше похоже на равномерное. Гауссиана, у которойи, называетсястандартным нормальным распределением. Иногда бывает полезно тесно связанное с гауссовскимлогнормальноераспределение.Случайная величинаимеет логнормальное распределение,, если. Плотность логнормальной случайной величины равна а её среднее и дисперсию можно вычислить по формулам Плотностьпоказательного(экспоненциального) распределениясосредоточена на лучеи имеет параметр:,. Если, то Плотность показательного распределения является убывающей функцией на, а параметротвечает за скорость этого убывания: приубывание очень медленное, и распределение больше похоже на равномерное; при, наоборот, вся вероятностная масса сосредоточена около точки. Показательное распределение моделирует временные интервалы между случайными событиями, наступающими с постоянной скоростью, например: время ожидания автобуса на остановке; время между телефонными звонками в колл-центре; время до выхода из строя вычислительного узла в дата-центре. Гамма-распределениес положительными параметрамииимеет плотность где—гамма-функция Эйлера. Пригамма-распределение превращается в показательное с параметром. Среднее и дисперсия случайной величины, имеющей гамма-распределение с параметрамии, равны Плотностьбета-распределенияс параметрамиравна где—бета-функция Эйлера. Бета-распределение имеет следующее статистическое приложение. Выберем случайным образом точки, и упорядочим их по возрастанию. Получим набор значений Оказывается, что случайная величина, называемая-й порядковой статистикой, имеет бета распределение с параметрамии: При проверке статистических гипотез бывает полезнораспределение Стьюдента(t-distribution) сстепенями свободы, плотность которого равна где— гамма-функция Эйлера. Распределение Стьюдента похоже на стандартное нормальное распределение; более того, прионо превращается в. Однако при малых значенияхраспределение Стьюдента имеет гораздо более тяжёлые «хвосты»: например, приего дисперсия бесконечна, а прита же участь постигает и математическое ожидание (всё из-за расходимости соответствующих интегралов). В остальных случаях еслиимеет распределение Стьюдента сстепенями свободы. Плотностьраспределения Лапласас параметрамиравна Такое распределение иногда обозначают. Если, то Прираспределение Лапласа представляет собой экспоненциальное распределение, плотность которого симметрично отражена на отрицательную полуось: если, то. Распределение Лапласа похоже на нормальное и отличается от него немного более тяжёлыми «хвостами» и тем, что его плотность теряет гладкость в нуле.", "useful_links": [{"text": "гамма-функция Эйлера", "url": "https://ru.wikipedia.org/wiki/%D0%93%D0%B0%D0%BC%D0%BC%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F"}, {"text": "бета-функция Эйлера", "url": "https://ru.wikipedia.org/wiki/%D0%91%D0%B5%D1%82%D0%B0-%D1%84%D1%83%D0%BD%D0%BA%D1%86%D0%B8%D1%8F"}]}
{"document_title": "Вероятностные распределения", "url": "https://education.yandex.ru/handbook/ml/article/veroyatnostnye-raspredeleniya", "section_title": "Характеристики случайных величин", "text": "Если, то-й моментслучайной величиныравен. В зависимости от типа случайной величины моменты вычисляются по-разному: , еслипринимает дискретные значения; , еслиимеет плотность. Первый момент— это в точности математическое ожидание (среднее) случайной величины. Дисперсию тоже можно выразить через моменты: Не у всех случайных величин есть конечные среднее и дисперсия. Например,распределение Коши(оно жераспределение Стьюдентас одной степенью свободы) имеет плотность, и если мы попытаемся вычислить первые два момента, то получим расходящиеся интегралы Упражнение. Приведите пример дискретной случайной величины с бесконечным средним. Если, то. (линейность). Если, то(монотонность). . Если случайные величиныинезависимы, то. Если, то(неравенство Маркова). Если функциявыпукла вниз, то(неравенство Йенсена). Law of the unconscious statistician (LOTUS) Если случайная величинаполучена применением некоторой детерминированной функцией из случайной величины,, то , еслидискретна; , еслинепрерывна. Ковариацияслучайных величиниопределяется по формуле В частности,. На практике часто применяюткоэффициент корреляции, который получается нормированием ковариации: Коэффициент корреляции всегда принимает значения из отрезка. Если, то случайные величиныиназываютнекоррелированными. Свойства дисперсии и ковариации , причём. ,. ,. . Если случайные величиныинезависимы, тои. (неравенство Чебышева). Случайная величинаявляется числовой функцией, заданной на пространстве элементарных событий; однако, больший интерес обычно представляет порождаемое ею распределение вероятностей. В дискретном случае достаточно задать вероятности отдельных значений; для непрерывных же случайных величин на помощь приходят функция распределения и функция плотности. Функцией распределения(cumulative distribution function,cdf) случайной величиныназывается функция Свойства функции распределения: ,; функциянеубывающая; функциянепрерывна справа:; . Любая дискретная случайная величина имеет ступенчатую функцию распределения. К примеру, вот как выглядит график функциидля: Если непрерывная случайная величинаимеет непрерывную плотность, то откуда следует, что. В типичных случаях непрерывная случайная величина имеет гладкую возрастающую функцию распределения с двумя горизонтальными асимптотами. Вот примеры графиков функций распределения гауссовских случайных величин: Математическое ожидание — не единственная числовая метрика, с помощью которой можно пытаться охарактеризовать, чему равно в среднем значение случайной величины.Медианаразбивает вероятностную массу распределения на две равные части. Если случайная величинаимеет плотность, то её медианаопределяется из условия В терминах функции распределения это означает, что, или. В непрерывном случае функция распределениястрого возрастает, поэтому уравнениеимеет единственное решение. Для дискретных случайных величин это может быть не так, и поэтому в общем случае медиану определяют как число, удовлетворяющее условиям Например, если, то, и поэтому любое числоявляется медианой симметричного бернуллиевского распределения. Бесконечное количество медиан будет у всякой дискретной случайной величины, для которойна целом промежутке. Модараспределения максимизирует его pmf или pdf: Мод у распределения может быть больше одной; самое вырожденное в этом смысле распределение — равномерное, каждая точка носителя является его модой. Если плотность случайной величины имеет единственную точку максимума, то она и является модой. Например: , если; , если; мода t-распределения Стьюдента также равна нулю. Все такие распределенияунимодальны. Если плотностьимеет два или более максимума, то случайная величинаназываетсябимодальнойилимультимодальной. Для симметричных распределений вроде нормального математическое ожидание, медиана и мода совпадают, однако, в общем случае это три различные меры типичного среднего значения случайной величины. Смысл каждой из этой мер наглядно демострирует следующая иллюстрация: Упражнение. Найдите среднее, медиану и моду экспоненциального распределения с параметроми сравните их между собой. У внимательного читателя (отягощённого математическим образованием впридачу) может возникнуть вопрос: а все ли случайные величины относятся к дискретным или непрерывным? В буквально такой постановке ответ, конечно, отрицательный, поскольку можно получить гибридную случайную величину, сложив дискретную и непрерывную. Но, может быть, всякая случайная величина равна сумме непрерывной и дискретной компонент? В терминах функций распределения этот вопрос можно переформулировать так: верно ли, что всякая монотонная функцияможет быть представлена в виде, где— неубывающая ступенчатая функция (функция скачков), а — гладкая возрастающая функция, полученная интегрированием плотности?", "useful_links": [{"text": "распределение Стьюдента", "url": "#%D1%80%D0%B0%D1%81%D0%BF%D1%80%D0%B5%D0%B4%D0%B5%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D1%81%D1%82%D1%8C%D1%8E%D0%B4%D0%B5%D0%BD%D1%82%D0%B0"}]}
