[
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Дискретные многомерные распределения",
    "text": "Пусть, например, эксперимент состоит из двух фаз: сначала подбрасывается монетка, а затем кубик. Тогда вероятностная масса сосредоточена в точках,,. Вероятность каждого исхода можно записать в виде таблицы Результат подбрасывания монеты моделирует бернуллиевская случайная величина, а результат броска кубика — равномерно распределённая на множествеслучайная величина. Содержимое таблицы вероятностей каждого исхода можно также представить матрицей которая задаётсовместное распределениеслучайных величини:. Пару случайных величинв таком контексте называют такжеслучайным вектором. Элементы матрицыне обязаны совпадать; например, монета может быть несимметричной с вероятностью «успеха», и тогда таблица вероятностей примет вид Контрольный вопрос. Какая таблица вероятностей соответствует эксперименту, в котором результат подбрасывания монеты «портит» кубик следующим образом: на нём могут равновероятно выпасть только значенияилив случае «неудачи» и,илив случае «успеха»? В общем случае дискретное-мерное распределение задаётся многомерным тензором из неотрицательных чисел, суммирующихся в единицу. Такие тензоры используются для задания совместного распределения вероятностей случайного вектораиз дискретных случайных величин:",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Непрерывные многомерные распределения",
    "text": "Непрерывное распределение на плоскости задаётся плотностью; при этом вероятность событияравна при условии, что этот интеграл имеет смысл. Простейший пример — равномерное распределение на единичном квадрате: его плотность равна, и Именно так на единичном квадрате формально определяется геометрическая вероятность. Плотность непрерывного распределения вявляется неотрицательной функцией видасо свойством Говорят, что случайный векторимеетсовместную плотность, если для всех достаточно «хороших» (измеримых по Лебегу) множеств.",
    "useful_links": [
      {
        "text": "измеримых по Лебегу",
        "url": "https://ru.wikipedia.org/wiki/%D0%9C%D0%B5%D1%80%D0%B0_%D0%9B%D0%B5%D0%B1%D0%B5%D0%B3%D0%B0"
      }
    ]
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Маргинальные распределения",
    "text": "Из совместного распределения можно получить распределение в пространстве меньшей размерности путём суммирования или интегрирования по части переменных. Например, если матрицазадаёт совместное распределение случайных величини,, то каждый из наборов чисел неотрицателен и суммируется в единицу: Таким образом, числаизадают некоторые распределения вероятностей, называемыемаргинальными. Упражнение. Найдите маргинальные распределения, если совместное распределение задано матрицей В непрерывном случае ситуация похожая: если случайный вектор имеет совместную плотность, то функции являются плотностями маргинальных распределений. Для-мерных распределений можно находить маргинальные распределения, суммируя или интегрируя по любым наборам переменных с индексами; в результате получится маргинальное распределение по оставшимсяпеременным.",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Независимость случайных величин",
    "text": "Случайные величиныиназываютсянезависимыми, если совместное распределение случайного векторараспадается на произведение одномерных. Точнее говоря, дискретные случайные величиныинезависимы, еслидля всех возможныхи; непрерывные случайные величиныинезависимы, если их совместная плотность. Если случайные величиныинезависимы, то распределение каждой из них является маргинальным распределением их совместного распределения, поскольку и Случайные величинынезависимы в совокупности, если их совместное распределение (совместная плотность) распадается в произведение одномерных распределений (плотностей). Пример. Рассмотримгауссовских случайных величинс плотностями Совместную плотность случайного вектораопределим как произведение плотностей его компонент: Случайный векторс такой плотностью имеетмногомерное нормальное (гауссовское) распределениеc независимыми в совокупности компонентами. Любое маргинальное распределение случайного вектораобладает плотностью того же вида, и поэтому также является гауссовским.",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Характеристики случайных векторов",
    "text": "Математическое ожидание случайного вектораявляется вектором той же размерности и вычисляется покомпонентно: Каждая компонента случайного вектора — это обычная случайная величина, и её среднее можно вычислить стандартными методами: в дискретном случае; в непрерывном случае. Математическое ожидание перестановочно с линейным преобразованием случайного вектора:, где— фиксированная матрица. Вместо дисперсии у случайного вектораестьматрица ковариаций: Матрица ковариаций симметрична и состоит из попарных ковариаций компонент случайного вектора: Упражнение. Докажите, что ковариационная матрица любого случайного вектора неотрицательно определена. Если случайные величинынезависимы в совокупности, то, и ковариационая матрица случайного векторадиагональна: Например, матрица ковариации гауссовского случайного векторас плотностью равна, поскольку компоненты векторанезависимы в совокупности и имеют нормальное распределение. Аналогом ковариации в многомерном случае служит матрица ковариаций между случайными векторамии: Матрицу ковариаций можно также вычислить по формуле Упражнение. Пусть случайный векторполучен из случайного векторалинейным преобразованием:. Как связаны между собой их ковариационные матрицы?",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Преобразования плотностей случайных векторов",
    "text": "Нередко приходится иметь дело не с самими случайными векторами, а с функциями от них. Но как найти плотность случайного вектора, зная плотность? Предположим, что— гладкая обратимая функция. Тогда для измеримогоимеем Чтобы перейти к интегралу по, сделаем замену переменной. По формуле замены координат в кратном интеграле получаем где– якобиан преобразования, т.е. определитель матрицы Якоби.Таким образом, Упражнение. Пусть– случайный вектор с плотностью. Какова плотность случайного вектора, где– постоянный вектор, а– постоянная обратимая матрица?",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Распределение суммы независимых случайных величин",
    "text": "В дискретном случае найти распределение суммы двух независимых случайных величин несложно. В самом деле, В силу независимости случайных величинипоследняя сумма равна Полученная формула называетсяформулой свёртки. Пусть теперьи– независимые непрерывные случайные величины с плотностямиисоответственно. Сам собой напрашивается аналог формулы свёртки с плотностями вместо вероятностей, но чтобы достаточно строго вывести его и не запутаться, мы немного схитрим. А именно, мы рассмотрим случайный вектори его (обратимое!) преобразование Обратное к нему будет иметь вид Тогда по правилу преобразования плотности где в последнем равенстве мы воспользовались независимостьюи. Распределение случайной величины– это маргинальное распределение, которое вычисляется следующим образом: Эта формула также называетсяформулой свёртки.",
    "useful_links": []
  },
  {
    "document_title": "Многомерные распределения",
    "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya",
    "section_title": "Примеры многомерных распределений",
    "text": "Рассмотрим несколько популярных распределений случайных векторов. Биномиальное распределениемоделирует-кратное подбрасывание монеты с вероятностями «успеха»и «неудачи».Мультиномиальное распределениеобобщает этот эксперимент: теперь подбрасывается кубик сгранями, и вероятность выпадения-й грани равна,. Обозначим черезколичество выпадений-й грани в серии избросков. Тогда случайный векторимеет мультиномиальное распределение, при котором Примультиномиальное распределение превращается вкатегориальное, известное также под названиемmultinoulli. Категориальное распределение моделирует случайный выбор одного изклассов с заданными вероятностями. Многомерное нормальное (гауссовское) распределениезадаётся функцией плотности где,— невырожденная симметричная матрица размера. Такое распределение обозначается. Если случайный вектор, то,; таким образом, параметры гауссовского распределения — это его среднее и матрица ковариаций. Упражнение.Пустьи. Докажите, что. Важный частный случай случайного гауссовского вектора с независимыми компонентами был рассмотрен в примере из секции пронезависимость случайных величин. Такое распределение получается, если матрицадиагональна,. Тогда,, и поэтому Отсюда снова получаем формулу совместной плотности которую можно переписать в виде откуда следует независимость в совокупности компонент вектора. Если ковариационная матрицане является диагональной, то отдельные компоненты случайного векторазависимы. Тем не менее, всегда найдётся линейное (и даже ортогональное) преобразование, которое превратит векторв гауссовский вектор с независимыми компонентами. Для этого достаточно найти ортогональную матрицусо свойством и далее воспользоваться формулой плотности линейного преобразования гауссовского вектора. По тем же соображениям облако точек, сгенерированных из распределения, будет напоминать эллипсоид с полуосями, пропорциональными вектору. Линии уровня плотностизадаются уравнениями вида, а такое равенство эквивалентно квадратичной форме гдеи– некоторые константы. С помощью описанной выше ортогональной замены эта квадратичная форма может быть приведена к главным осям: в координатах это выглядит как Мы получили практически каноническое уравнение-мерного эллипсоида. Вэто будут эллипсы, сплюснутые тем сильнее, чем дальше от единицы отношениесобственных значений матрицы. Нормальным будет и всякое маргинальное распределение многомерного гауссовского вектора. Упражнение. Пусть случайный векторимеет гауссовское распределение с параметрами где,,,,.Докажите, что случайный вектор, полученный маргинализацией по компонентам вектора, является гауссовским с параметрамии. Распределение Дирихлесосредоточено на-мерном симплексе Плотность распределения Дирихлеравна где– вектор положительных параметров, а– многомерная бета-функция. Если,то",
    "useful_links": [
      {
        "text": "независимость случайных величин",
        "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya#nezavisimost-sluchajnyh-velichin"
      }
    ]
  }
]