{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Условная вероятность", "text": "Условная вероятность возникает при ответе на вопрос о том, каковы шансы событияпри условии,что случилось событие, и обозначается. Пример. Согласно исследованиям, в среднемпациентов испытывают приступы кашля в течение дня, однако среди курильщиков доля кашляющих составляет. То есть (безусловная) вероятностьпри добавлении обусловливания может существенно измениться:. Упражнение. Известно, что в семье два ребёнка, причём один из них мальчик. Какова вероятность, что другой ребёнок тоже мальчик? В общем случае условная вероятностьприполагается равной В зависимости от соотношения событийиусловная вероятностьможет принимать разные значения, например: если, то событиеисключает реализацию события, и; если, то событиегарантирует осуществление события, и. Разумеется, чаще всего событияисоотносятся между собой более хитрым образом, и значение условной вероятностинаходится строго междуи.", "useful_links": []}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Формула полной вероятности", "text": "Пусть пространстворазбивается на попарно несовместные события: Тогда отсюда по свойству конечной аддитивности находим, что Переходя к условным вероятностям, получаемформулу полной вероятности: Пример. Среди населенияимеют первую группу крови,— вторую,— третью,— четвёртую. При переливании крови надо учитывать группы крови донора и рецепиента: реципиенту с четвёртой группой крови можно перелить кровь любой группы; реципиентам со второй и третьей группами можно перелить кровь той же группы или первой; реципиентам с первой группой крови можно перелить только кровь первой группы. С какой вероятностью допустимо переливание в случайно взятой паре донор—реципиент? Решение. Пусть событиесостоит в том, что переливание возможно, а событие— в том, что донор имеет группу. По формуле полной вероятности Вероятностиданы в условии, оттуда же находим, что Подставляя численные значения, получаем Упражнение. Решите предыдущий пример, выбирая в качестве разбиения набор событий, каждое из которых заключается в том, что реципиент имеет группу. Формула полной вероятности легко обобщается на случай счётного числа попарно несовместных событий, а также на случай обусловливания по некоторому событию, например:", "useful_links": []}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Формула Байеса", "text": "Заметим, что вероятностьможно записать двумя способами Оставимв левой части и получим формулу Байеса. Формула Байеса. Для любых событий,c положительной вероятностью Для вычисления знаменателя в формуле Байеса часто используется формула полной вероятности. Упражнение. Среди определенной группы людей вероятность некоторой болезни 0.02. Тест, позволяющий выявить болезнь, несовершенен. На больном он дает позитивный результат в 98 случаях из 100, и, кроме того, он дает позитивный результат в 4 случаях из 100 на здоровом. Найдите вероятность того, что человек, на котором тест дал положительный результат, действительно болен. Для непрерывного случая тоже есть своя формула полной вероятности, см. раздел проусловную вероятность.", "useful_links": [{"text": "условную вероятность", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej#uslovnye-raspredeleniya"}]}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Независимые события", "text": "Событияиназываютсянезависимыми, если, то есть информация о реализации событияникак не влияет на вероятность события. По определению условной вероятности независимость событийиэквивалентна тому, что Последнее равенство годится для определения независмости событийидаже в том случае, еслиили. Пример. В полной колоде карт находитсякарты:масти от двойки до туза. Вероятность вытащить туза равна, карту пиковой масти —. Эти события независимы, поскольку в пересечении этих событий лежит ровно одна карта — туз пик, вероятность появления которого равна. Пусть теперь вытаскивается сразу две карты. Зависимы ли события «вытащены две карты пиковой масти» и «вытащены туз и король»? Посчитаем: Вероятность вытащить туза и короля пик равна, что отличается от. Таким образом, эти события зависимы. Событияпопарно независимы, еслипри. Эти же событиянезависимы в совокупности, если Упражнение. Приведите пример попарно независимых событий,,, не являющихся независимыми в совокупности. Определениенезависимости случайных величиниз предыдущего параграфа полностью согласуется с только что введённым определением независимых событий. Например, для случая дискретных случайных величиниобозначим тогда, и поэтому независимость случайных величиниэквивалентна независимости событийидля всевозможных значенийи.", "useful_links": [{"text": "независимости случайных величин", "url": "https://education.yandex.ru/handbook/ml/article/mnogomernye-raspredeleniya#nezavisimost-sluchajnyh-velichin"}]}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Условная независимость", "text": "Бывает так, что зависимые событияистановятся независимыми при выполнении некоторого третьего события. Более формально, событияиусловно независимыпо отношению к событию, еслии Поскольку то условная независимость событийиэквивалетна равенству а это, в свою очередь, означает, что Таким образом, вероятность произведения условно независимых событий равна произведению условных вероятностей. Эта формула полностью аналогична формуледля (безусловно) независимых событий. Пример(цепь Маркова). Последовательность событийназываетсямарковской цепью, если выполняетсямарковское свойство В марковском свойстве заложен следующий смысл: в каждый момент времени«будущее»зависит только от «настоящего», но не зависит от «прошлого» Итак, цепь Маркова характеризуется равенством, которое означает, что событияиусловно независимы по отношению к событию.", "useful_links": []}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Условные распределения", "text": "Пустьи— дискретные случайные величины и. По аналогии с условными вероятностямиусловное распределениеслучайной величиныпри условии, что значение случайной величиныравно, определяется по формуле Это действительно распределение вероятностей, посколькуи В непрерывном случае условное распределение задаётсяусловной плотностью где— совместная плотность случайных величини. И снова проведением маргинализации поубеждаемся в том, что с нормировкой всё в порядке: Поскольку, из формулы условной плотности получаем непрерывный аналогформулы полной вероятности: Пример. Выберем случайное число, а затем — случайное число. Как распределена случайная величина? Переформулируем задачу: известно, чтои. Требуется найти плотность случайной величины. Имеем Применяя формулу полной вероятности, находим Упражнение. Пусть случайные величины,, независимы в совокупности. Чему равна вероятность?", "useful_links": []}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Условные математические ожидания", "text": "Условное математическое ожиданиеотвечает на вопрос «чему равно среднее значение случайной величиныпри условии, что?».Имея в распоряжении матрицу условного дискретного распределенияили условную плотность, условное математическое ожидание можно вычислить следующим образом: в дискретном случае; для непрерывныхи. Важно отметить, что после суммирования или интегрирования по переменнойв формуле условного математического ожидания остаются зависимость от. Таким образом, в отличие от обычного среднего, которое является просто числом, условное ожидание представляет собой случайную величину, поскольку его значение зависит от случайного значения. Свойства условного математического ожидания (линейность). Если, то(монотонность). Если случайные величиныинезависимы, то. . (law of total expectation). Упражнение.Prove the law of total expectation. Условная дисперсияопределяется по формуле Справедливо равенство(law of total variance).", "useful_links": []}
{"document_title": "Независимость и условные распределения вероятностей", "url": "https://education.yandex.ru/handbook/ml/article/nezavisimost-i-uslovnye-raspredeleniya-veroyatnostej", "section_title": "Регрессия", "text": "В машинном обучении часто встречается задачарегрессии, в которой требуется восстановить зависимостьпри наличии выборки из некоторого неизвестного распределения с совместной плотностью. Стандартный способ решения задачи регресии — минимизация среднего значенияфункции потерь: В качестве функции потерь на одном объектев задаче регрессии обычно выбирают квадратичную функцию:. Тогда для минимизации этого функционала применим немножко вариационного исчисления и продифференцируем по функции. Получим откуда Полученное условное математическое ожидание, называемоефункцией регрессии, показывает, чему в среднем равно значение зависимой переменнойпри условии, что.", "useful_links": []}
