{"document_title": "Параметрические оценки", "url": "https://education.yandex.ru/handbook/ml/article/parametricheskie-ocenki", "section_title": "Предельные теоремы", "text": "Как правило, чем больше размер выборки, тем более информативны параметрические оценки вида. Теоретические свойства таких оценок приустанавливаются с помощью предельных теорем теории вероятностей. Внимательный читатель мог обратить внимание, что в ряде примеров из предыдущих параграфов параметры некоторых распределений почему-то молчаливо подменялись средними значениями. Так мы поступили в задаче о показе рекламы, взяв в качестве параметра пуассоновского распределение среднее количество кликов пользователей. Фактически мы оценили неизвестный параметрасредним по выборке: В общем-то это кажется логичным, поскольку, если. Однако у такой оценки есть также мощное теоретическое обоснование. Теорема (Закон больших чисел, ЗБЧ). Пусть– последовательность попарно независимых одинаково распределенных случайных величин с конечным математическим ожиданием. Тогда для любого Таким образом, чем больше размер выборки, тем менее вероятно отклонениевыборочного среднегоот истинного среднегона любое число. Закон больших чисел особенно легко обосновать для случая конечных дисперсий:. Имеем Отсюда видно, что, поэтому при большихраспределение случайной величинывсё больше похоже на распределение, сосредоточенное в одной лишь точке. Формально же утверждение ЗБЧ получается с помощью неравенства Чебышева: Закон больших чисел допускает следующее усиление. Теорема (Усиленный закон больших чисел, УЗБЧ). Пусть– последовательность попарно независимых одинаково распределенных случайных величин с конечным математическим ожиданием. Тогда выборочное среднеепочти наверноесходится к, т.е.. Доска Гальтонаиллюстрирует биномиальное распределение. До поворота на ее дне лежит множество маленьких шариков. Сразу после переворота шарики проходят через 10 рядов гладких круглых препятствий. Преодоление каждого препятствия можно рассматривать как испытание Бернулли: с равными вероятностями шарик может пойти как налево, так и направо. Поэтому финальное положение шарика в одной из 10 корзин является приблизительной реализацией биномиального распределения. Уже прибиномиальное распределение напоминает нормальное. И действительно, чем больше, тем лучше дискретная случайная величинааппроксимируется непрерывной гауссианой. Теорема Муавра-Лапласа. Пусть,, тогда Из теоремы Муавра-Лапласа вытекает, что при большихвероятность попадания биномиальной случайной величиныв заданный интервал можно оценить как где— функция распределения стандартного нормального распределения. При выводе закона больших чисел мы видели, что выборочное среднееимеет среднееи дисперсию. Но как именно выглядит распределение случайной величиныпри увеличении? Оказывается, что оно становится всё больше похоже на. Вот как, например, выглядят нормализованные гистограммывыборочных средних, построенных по i.i.d. выборкамдля разных значений: Эти гистограммы и впрямь очень напоминают гауссианы, и это прямое следствие следующей теоремы. Центральная предельная теорема, ЦПТ. Пусть– последовательность попарно независимых одинаково распределенных случайных величин с конечным математическим ожиданиеми дисперсией. Тогда Точнее говоря,. Таким образом, случайная величинасходится по распределениюк:. Если применить центральную предельную теорему к бернуллиевским случайным величинам с вероятностью успеха, то вновь получим теорему Муавра-Лапласа.", "useful_links": [{"text": "Доска Гальтона", "url": "https://ru.wikipedia.org/wiki/%D0%94%D0%BE%D1%81%D0%BA%D0%B0_%D0%93%D0%B0%D0%BB%D1%8C%D1%82%D0%BE%D0%BD%D0%B0"}]}
{"document_title": "Параметрические оценки", "url": "https://education.yandex.ru/handbook/ml/article/parametricheskie-ocenki", "section_title": "Свойства параметрических оценок", "text": "Оценивать параметры можно по-разному, хочется делать это хорошо. Ценные свойства оценок, которые обычно желательны – этонесмещенностьисостоятельность. Каждый элемент i.i.d выборкиможно рассматривать как значение случайной величины из некоторого распределения с неизвестным параметром.А раз так, то всякую оценку этого параметратакже можно считать случайной величиной, у которой можно пытаться вычислять математическое ожидание, например. Оценкапараметраназываетсянесмещенной, если. Несмещённость оценки означает, что она в среднем будет равна истинному значению параметра. Интуитивно можно представлять себе несмещённость следующим образом: если мы нагенерим большое количество выборок,, и для каждой посчитаем оценку, то в среднем получится более или менее истинное значение параметра:. Простейший пример несмещённой оценки среднего значениядаёт выборочное среднее, поскольку Медианойвыборкиназывается средний членвариационного ряда, состоящего из отсортированных по возрастанию элементов выборки: Еслинечётно,, то есть ровно один элемент в середине вариационного ряда, именно он называется медианой:. При чётномв качестве медианы берут среднее двух центральных элементов вариационного ряда: Упражнение.Дана i.i.d. выборкаиз равномерного распределения. Докажите, что выборочная медиана даёт несмещённую оценку медианы распределения. В некоторых случаях оценкасмещена, но с ростомэто смещение нивелируется. Если, то оценканазываетсяасимптотически несмещённой. Упражнение.Пусть— i.i.d. выборка. Оценим параметркак максимальное значение выборки: Является ли эта оценка несмещённой? Асимптотически несмещённой? Оценканазываетсясостоятельной, если она сходится по вероятности к,, то есть Cостоятельность означает, что с ростом размера выборки всё менее вероятны хоть сколько нибудь значимые отклонения оценки от истинного значения параметра. Если i.i.d. выборкаполучена из распределения с конечным математическим ожиданием, то в силу закона больших чисел выборочное среднееявляется состоятельной оценкой для. Состоятельность оценки – независимое от несмещенности свойство: оценки могут быть состоятельными, но не несмещенными и наоборот. Например, оценкаиз предыдущего упражнения оказалась смещённой, однако, она состоятельна: Упражнение. Приведите пример несмещённой оценки, не являющейся состоятельной. Имея i.i.d. выборкуиз невырожденного распределения с конечным средним, оценим это среднее как. Эта оценка, очевидно, несмещённая:. Состоятельной, однако, она не является, ведь выражение никоим образом не зависит от. Следовательно, состоятельность оценкиозначала бы, чтодля любого. Такое возможно только для вырожденного распределения, сосредоточенного в одной лишь точке:. Смещение(bias) оценкиопределяется как Смещение показывает, насколько оценка в среднем отклоняется от истинного значения. Оценка несмещённая, если; асимптотически несмещённая, если. Среднеквадратичной ошибкой(mean squared error,MSE) оценки называется величина Смещение, дисперсия и среднеквадратичная ошибка связаны между собой следующим соотношением (bias-variance decomposition): Упражнение. Докажите, что оценкасостоятельная, если она асимптотически несмещённая и. Таким образом, если, то оценкапараметраасимптотически несмещённая и состоятельная. Стандартным отклонениемоценкипараметраназывается корень из дисперсии: Оценкаасимптотически нормальна, если, т.е. Согласно центральной предельной теореме выборочное среднее i.i.d. выборки из распределения с конечными средними дисперсиейявляется асимптотически нормальной оценкой параметра. Пустьи— несмещённые оценки параметра. Оценкаэффективнееоценки, если. Такое определение эффективности вполне логично, ведь чем меньше дисперсия несмещённой оценки, тем меньше у неё шансов удалиться куда-то далеко от истинного значения параметра. Пример. Пусть— i.i.d. выборка из распределения. Какая оценка параметраэффективнее: выборочное среднее или медиана? Несмещённость оценокиуже была показана выше. Найдём дисперсию наших оценок. Диспресия случайной величиныравна, следовательно,. Найти дисперсию медианы несколько сложнее. Ограничимся случаем. Тогда, и С помощью заменыотсюда находим, что Следовательно,, что прибольше, чем, так что выборочное среднее эффективнеемедианы (примерно враз при больших, если считать по отношению стандартных отклонений). Несмотря на то что в плане эффективности среднее оказалось предпочтительнее в этом примере,в статистике медиану любят за бОльшую устойчивость к выбросам. Ниже приведён scatter-plot, по которому можно наглядно оценить меру разброса среднего и медианы выборки из равномерного распределения на отрезкедля. Для построения этого графика были взятыi.i.d. выборок изразмера, и для каждогопосчитаны выборочное среднее и медиана. Эти статистики и задают координаты точки на графике. Разумеется, чем больше значение, тем кучнее локализованы точки вокруг среднего значения, совпадающего в данном случае с медианой. Как видно, облако точек сосредоточено вдоль прямой. Как мы уже убедились, выборочное среднеепредставляет собой несмещённую и состоятельную оценку для математического ожидания. Можно ли то же самое сказать провыборочную дисперсию в предположении, что i.i.d. выборкасостоит из реализаций случайной величиныс конечными моментамии? Прежде всего раскроем скобки и перепишемв виде где— выборочное среднее, построенное по выборке. Оно несмещённое, поэтому. Заметим также, что откуда в силу независимостииприполучаем Итак, Таким образом, оценка дисперсиисмещённая (хотя и асимптотически несмещённая). По этой причине для оценки дисперсии часто используют аналогичную несмещённую оценку которую также называют выборочной дисперсией. Обоснуем теперь состоятельность оценки. Согласно закону больших чисел,. Здесь нам потребуется пара свойств сходимости по вероятности. Упражнение. Пусть,. Докажите, что. Упражнение. Пусть. Докажите, что. Пользуясь результатами этих упражнений, заключаем, чтои, и, стало быть, оценкасостоятельна.", "useful_links": []}
{"document_title": "Параметрические оценки", "url": "https://education.yandex.ru/handbook/ml/article/parametricheskie-ocenki", "section_title": "Методы оценки параметров", "text": "До этого мы обсуждали разные приятные свойства оценок, а теперь рассмотрим некоторые методы, позволяющие систематически получать по выборке оценки параметров с нужными свойствами. Пусть выборкаполучена сэмплированием из некоторого семейства распределенийс параметрами.Метод моментовдля оценки этих параметров заключается в приравнивании выборочных моментов к теоретическим Решая полученную систему уравнений,, находим оценки параметров. Пример. Оценим параметры нормального распределенияс помощью метода моментов. Упражнение. Оцените по методу моментов параметрыидля выборкииз. При некоторых условиях на регулярность семейства распределенийоценка по методу моментов получается состоятельной и асимптотически нормальной. Пусть, как обычно, выборка.Правдоподобие(функция правдоподобия,likelihood) выборки— это просто её совместная pmf или pdf. Вне зависимости от типа распределения будем обозначать правдоподобие как Если выборка i.i.d., то функция правдоподобия распадается в произведение одномерных функций: Оценка максимального правдоподобия(maximum likelihood estimation,MLE) максимизирует правдоподобие: Поскольку максимизировать сумму проще, чем произведение, обычно переходят к логарифму правдоподобия (log-likelihood). Это особенно удобно в случае i.i.d. выборки, тогда Пример. В результатеподбрасываний монеты выпало«орлов» и«решек».Оценим вероятность выпадения «орла» методом максимального правдоподобия. Пусть— вероятность выпадения «орла», тогда правдоподобие равно Дифференцируя логарифм правдоподобия и приравнивая к нулю производную, находим Нетрудно убедиться, что это точка максимума. Итак, оценка максимального правдоподобиявероятности «успеха» в схеме Бернулли вполне ожидаемо оказалась равна доле «успехов» в серии изиспытаний. Упражнение. Пусть i.i.d. выборкавзята из пуассоновского распределения с параметром. Найдите его оценку максимального правдоподобия. Методом максимального правдоподобия можно оценить сразу несколько параметров. Пример. Найдём MLE-оценки параметров распределенияпо i.i.d. выборке. Запишем правдоподобие: Перейдём к log-likelihood: Приравняем частные производные поик нулю: откуда– выборочное среднее,– выборочная дисперсия. Упражнение. Пусть i.i.d. выборка. Найдите оценки максимального правдоподобия для параметрови. Свойства оценки максимального правдоподобия состоятельность:; инвариантность относительно параметризации: если— MLE-оценка для, то— MLE-оценка для; асимптотическая нормальность:; асимптотическая оптимальность: при достаточно большихоценкаимеет минимальную дисперсию.", "useful_links": []}
